Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x5f5 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5b12): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x2557): ../AZURE_RTOS/App/app_azure_rtos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa29b): C:/Users/david/Documents/GitHub/MotorControl/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 7	(unsigned)
    <2c>   DW_AT_name        : (indirect string, offset: 0x2701): unsigned int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 5	(signed)
    <33>   DW_AT_name        : int
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5e29): long long int
 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><45>: Abbrev Number: 2 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x978): signed char
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0x3b46): unsigned char
 <1><53>: Abbrev Number: 2 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0xbeb): short int
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x7ae6): short unsigned int
 <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x7eef): long int
 <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 4
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x1dd6): long unsigned int
 <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 8
    <71>   DW_AT_encoding    : 7	(unsigned)
    <72>   DW_AT_name        : (indirect string, offset: 0x228c): long long unsigned int
 <1><76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <77>   DW_AT_byte_size   : 4
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 1
    <7a>   DW_AT_encoding    : 8	(unsigned char)
    <7b>   DW_AT_name        : (indirect string, offset: 0x97f): char
 <1><7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <80>   DW_AT_name        : (indirect string, offset: 0x9fa7): CHAR
    <84>   DW_AT_decl_file   : 2
    <85>   DW_AT_decl_line   : 108
    <86>   DW_AT_decl_column : 49
    <87>   DW_AT_type        : <0x78>
 <1><8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x9fa6): UCHAR
    <90>   DW_AT_decl_file   : 2
    <91>   DW_AT_decl_line   : 109
    <92>   DW_AT_decl_column : 49
    <93>   DW_AT_type        : <0x4c>
 <1><97>: Abbrev Number: 5 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x6dfa): UINT
    <9c>   DW_AT_decl_file   : 2
    <9d>   DW_AT_decl_line   : 111
    <9e>   DW_AT_decl_column : 49
    <9f>   DW_AT_type        : <0x29>
 <1><a3>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x415a): ULONG
    <a8>   DW_AT_decl_file   : 2
    <a9>   DW_AT_decl_line   : 113
    <aa>   DW_AT_decl_column : 49
    <ab>   DW_AT_type        : <0x68>
 <1><af>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b0>   DW_AT_name        : (indirect string, offset: 0x3aca): TX_TIMER_INTERNAL_STRUCT
    <b4>   DW_AT_byte_size   : 28
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 285
    <b8>   DW_AT_decl_column : 16
    <b9>   DW_AT_sibling     : <0x120>
 <2><bd>: Abbrev Number: 7 (DW_TAG_member)
    <be>   DW_AT_name        : (indirect string, offset: 0x5d3b): tx_timer_internal_remaining_ticks
    <c2>   DW_AT_decl_file   : 3
    <c3>   DW_AT_decl_line   : 289
    <c5>   DW_AT_decl_column : 25
    <c6>   DW_AT_type        : <0xa3>
    <ca>   DW_AT_data_member_location: 0
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0xa7f8): tx_timer_internal_re_initialize_ticks
    <d0>   DW_AT_decl_file   : 3
    <d1>   DW_AT_decl_line   : 290
    <d3>   DW_AT_decl_column : 25
    <d4>   DW_AT_type        : <0xa3>
    <d8>   DW_AT_data_member_location: 4
 <2><d9>: Abbrev Number: 7 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x6471): tx_timer_internal_timeout_function
    <de>   DW_AT_decl_file   : 3
    <df>   DW_AT_decl_line   : 293
    <e1>   DW_AT_decl_column : 27
    <e2>   DW_AT_type        : <0x12b>
    <e6>   DW_AT_data_member_location: 8
 <2><e7>: Abbrev Number: 7 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x9540): tx_timer_internal_timeout_param
    <ec>   DW_AT_decl_file   : 3
    <ed>   DW_AT_decl_line   : 294
    <ef>   DW_AT_decl_column : 25
    <f0>   DW_AT_type        : <0xa3>
    <f4>   DW_AT_data_member_location: 12
 <2><f5>: Abbrev Number: 7 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x113f): tx_timer_internal_active_next
    <fa>   DW_AT_decl_file   : 3
    <fb>   DW_AT_decl_line   : 300
    <fd>   DW_AT_decl_column : 26
    <fe>   DW_AT_type        : <0x131>
    <102>   DW_AT_data_member_location: 16
 <2><103>: Abbrev Number: 7 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0xa3d0): tx_timer_internal_active_previous
    <108>   DW_AT_decl_file   : 3
    <109>   DW_AT_decl_line   : 301
    <10b>   DW_AT_decl_column : 26
    <10c>   DW_AT_type        : <0x131>
    <110>   DW_AT_data_member_location: 20
 <2><111>: Abbrev Number: 7 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x5450): tx_timer_internal_list_head
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 305
    <119>   DW_AT_decl_column : 27
    <11a>   DW_AT_type        : <0x137>
    <11e>   DW_AT_data_member_location: 24
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <121>   DW_AT_prototyped  : 1
    <121>   DW_AT_sibling     : <0x12b>
 <2><125>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <126>   DW_AT_type        : <0xa3>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_type        : <0x120>
 <1><131>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <132>   DW_AT_byte_size   : 4
    <133>   DW_AT_type        : <0xaf>
 <1><137>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <138>   DW_AT_byte_size   : 4
    <139>   DW_AT_type        : <0x131>
 <1><13d>: Abbrev Number: 11 (DW_TAG_typedef)
    <13e>   DW_AT_name        : (indirect string, offset: 0x8d68): TX_TIMER_INTERNAL
    <142>   DW_AT_decl_file   : 3
    <143>   DW_AT_decl_line   : 310
    <145>   DW_AT_decl_column : 3
    <146>   DW_AT_type        : <0xaf>
 <1><14a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <14b>   DW_AT_byte_size   : 4
    <14c>   DW_AT_type        : <0x7f>
 <1><150>: Abbrev Number: 6 (DW_TAG_structure_type)
    <151>   DW_AT_name        : (indirect string, offset: 0x75b3): TX_THREAD_STRUCT
    <155>   DW_AT_byte_size   : 176
    <156>   DW_AT_decl_file   : 3
    <157>   DW_AT_decl_line   : 369
    <159>   DW_AT_decl_column : 16
    <15a>   DW_AT_sibling     : <0x373>
 <2><15e>: Abbrev Number: 7 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x40a0): tx_thread_id
    <163>   DW_AT_decl_file   : 3
    <164>   DW_AT_decl_line   : 376
    <166>   DW_AT_decl_column : 25
    <167>   DW_AT_type        : <0xa3>
    <16b>   DW_AT_data_member_location: 0
 <2><16c>: Abbrev Number: 7 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0x7534): tx_thread_run_count
    <171>   DW_AT_decl_file   : 3
    <172>   DW_AT_decl_line   : 377
    <174>   DW_AT_decl_column : 25
    <175>   DW_AT_type        : <0xa3>
    <179>   DW_AT_data_member_location: 4
 <2><17a>: Abbrev Number: 7 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x2ccf): tx_thread_stack_ptr
    <17f>   DW_AT_decl_file   : 3
    <180>   DW_AT_decl_line   : 378
    <182>   DW_AT_decl_column : 26
    <183>   DW_AT_type        : <0x76>
    <187>   DW_AT_data_member_location: 8
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x6fd5): tx_thread_stack_start
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 379
    <190>   DW_AT_decl_column : 26
    <191>   DW_AT_type        : <0x76>
    <195>   DW_AT_data_member_location: 12
 <2><196>: Abbrev Number: 7 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x9064): tx_thread_stack_end
    <19b>   DW_AT_decl_file   : 3
    <19c>   DW_AT_decl_line   : 380
    <19e>   DW_AT_decl_column : 26
    <19f>   DW_AT_type        : <0x76>
    <1a3>   DW_AT_data_member_location: 16
 <2><1a4>: Abbrev Number: 7 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x9106): tx_thread_stack_size
    <1a9>   DW_AT_decl_file   : 3
    <1aa>   DW_AT_decl_line   : 381
    <1ac>   DW_AT_decl_column : 25
    <1ad>   DW_AT_type        : <0xa3>
    <1b1>   DW_AT_data_member_location: 20
 <2><1b2>: Abbrev Number: 7 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xda544): tx_thread_time_slice
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 382
    <1ba>   DW_AT_decl_column : 25
    <1bb>   DW_AT_type        : <0xa3>
    <1bf>   DW_AT_data_member_location: 24
 <2><1c0>: Abbrev Number: 7 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3d33): tx_thread_new_time_slice
    <1c5>   DW_AT_decl_file   : 3
    <1c6>   DW_AT_decl_line   : 383
    <1c8>   DW_AT_decl_column : 25
    <1c9>   DW_AT_type        : <0xa3>
    <1cd>   DW_AT_data_member_location: 28
 <2><1ce>: Abbrev Number: 7 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x6c1b): tx_thread_ready_next
    <1d3>   DW_AT_decl_file   : 3
    <1d4>   DW_AT_decl_line   : 387
    <1d6>   DW_AT_decl_column : 26
    <1d7>   DW_AT_type        : <0x373>
    <1db>   DW_AT_data_member_location: 32
 <2><1dc>: Abbrev Number: 7 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xbb4): tx_thread_ready_previous
    <1e1>   DW_AT_decl_file   : 3
    <1e2>   DW_AT_decl_line   : 388
    <1e4>   DW_AT_decl_column : 26
    <1e5>   DW_AT_type        : <0x373>
    <1e9>   DW_AT_data_member_location: 36
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x7cff): tx_thread_name
    <1ef>   DW_AT_decl_file   : 3
    <1f0>   DW_AT_decl_line   : 396
    <1f2>   DW_AT_decl_column : 26
    <1f3>   DW_AT_type        : <0x14a>
    <1f7>   DW_AT_data_member_location: 40
 <2><1f8>: Abbrev Number: 7 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x38ec): tx_thread_priority
    <1fd>   DW_AT_decl_file   : 3
    <1fe>   DW_AT_decl_line   : 397
    <200>   DW_AT_decl_column : 25
    <201>   DW_AT_type        : <0x97>
    <205>   DW_AT_data_member_location: 44
 <2><206>: Abbrev Number: 7 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x129f): tx_thread_state
    <20b>   DW_AT_decl_file   : 3
    <20c>   DW_AT_decl_line   : 398
    <20e>   DW_AT_decl_column : 25
    <20f>   DW_AT_type        : <0x97>
    <213>   DW_AT_data_member_location: 48
 <2><214>: Abbrev Number: 7 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x9664): tx_thread_delayed_suspend
    <219>   DW_AT_decl_file   : 3
    <21a>   DW_AT_decl_line   : 399
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0x97>
    <221>   DW_AT_data_member_location: 52
 <2><222>: Abbrev Number: 7 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x66f5): tx_thread_suspending
    <227>   DW_AT_decl_file   : 3
    <228>   DW_AT_decl_line   : 400
    <22a>   DW_AT_decl_column : 25
    <22b>   DW_AT_type        : <0x97>
    <22f>   DW_AT_data_member_location: 56
 <2><230>: Abbrev Number: 7 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x27ac): tx_thread_preempt_threshold
    <235>   DW_AT_decl_file   : 3
    <236>   DW_AT_decl_line   : 401
    <238>   DW_AT_decl_column : 25
    <239>   DW_AT_type        : <0x97>
    <23d>   DW_AT_data_member_location: 60
 <2><23e>: Abbrev Number: 7 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x51b7): tx_thread_schedule_hook
    <243>   DW_AT_decl_file   : 3
    <244>   DW_AT_decl_line   : 406
    <246>   DW_AT_decl_column : 27
    <247>   DW_AT_type        : <0x389>
    <24b>   DW_AT_data_member_location: 64
 <2><24c>: Abbrev Number: 7 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <251>   DW_AT_decl_file   : 3
    <252>   DW_AT_decl_line   : 414
    <254>   DW_AT_decl_column : 27
    <255>   DW_AT_type        : <0x12b>
    <259>   DW_AT_data_member_location: 68
 <2><25a>: Abbrev Number: 7 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xe94): tx_thread_entry_parameter
    <25f>   DW_AT_decl_file   : 3
    <260>   DW_AT_decl_line   : 415
    <262>   DW_AT_decl_column : 25
    <263>   DW_AT_type        : <0xa3>
    <267>   DW_AT_data_member_location: 72
 <2><268>: Abbrev Number: 7 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3aba): tx_thread_timer
    <26d>   DW_AT_decl_file   : 3
    <26e>   DW_AT_decl_line   : 419
    <270>   DW_AT_decl_column : 25
    <271>   DW_AT_type        : <0x13d>
    <275>   DW_AT_data_member_location: 76
 <2><276>: Abbrev Number: 7 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x71ac): tx_thread_suspend_cleanup
    <27b>   DW_AT_decl_file   : 3
    <27c>   DW_AT_decl_line   : 425
    <27e>   DW_AT_decl_column : 27
    <27f>   DW_AT_type        : <0x389>
    <283>   DW_AT_data_member_location: 104
 <2><284>: Abbrev Number: 7 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x7056): tx_thread_suspend_control_block
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 426
    <28c>   DW_AT_decl_column : 26
    <28d>   DW_AT_type        : <0x76>
    <291>   DW_AT_data_member_location: 108
 <2><292>: Abbrev Number: 7 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x6c02): tx_thread_suspended_next
    <297>   DW_AT_decl_file   : 3
    <298>   DW_AT_decl_line   : 428
    <29a>   DW_AT_decl_column : 26
    <29b>   DW_AT_type        : <0x373>
    <29f>   DW_AT_data_member_location: 112
 <2><2a0>: Abbrev Number: 7 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x4231): tx_thread_suspended_previous
    <2a5>   DW_AT_decl_file   : 3
    <2a6>   DW_AT_decl_line   : 429
    <2a8>   DW_AT_decl_column : 26
    <2a9>   DW_AT_type        : <0x373>
    <2ad>   DW_AT_data_member_location: 116
 <2><2ae>: Abbrev Number: 7 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x76d4): tx_thread_suspend_info
    <2b3>   DW_AT_decl_file   : 3
    <2b4>   DW_AT_decl_line   : 430
    <2b6>   DW_AT_decl_column : 25
    <2b7>   DW_AT_type        : <0xa3>
    <2bb>   DW_AT_data_member_location: 120
 <2><2bc>: Abbrev Number: 7 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x7e92): tx_thread_additional_suspend_info
    <2c1>   DW_AT_decl_file   : 3
    <2c2>   DW_AT_decl_line   : 431
    <2c4>   DW_AT_decl_column : 26
    <2c5>   DW_AT_type        : <0x76>
    <2c9>   DW_AT_data_member_location: 124
 <2><2ca>: Abbrev Number: 7 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x23f5): tx_thread_suspend_option
    <2cf>   DW_AT_decl_file   : 3
    <2d0>   DW_AT_decl_line   : 432
    <2d2>   DW_AT_decl_column : 25
    <2d3>   DW_AT_type        : <0x97>
    <2d7>   DW_AT_data_member_location: 128
 <2><2d8>: Abbrev Number: 7 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x218d): tx_thread_suspend_status
    <2dd>   DW_AT_decl_file   : 3
    <2de>   DW_AT_decl_line   : 433
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0x97>
    <2e5>   DW_AT_data_member_location: 132
 <2><2e6>: Abbrev Number: 7 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xbf5): tx_thread_created_next
    <2eb>   DW_AT_decl_file   : 3
    <2ec>   DW_AT_decl_line   : 442
    <2ee>   DW_AT_decl_column : 26
    <2ef>   DW_AT_type        : <0x373>
    <2f3>   DW_AT_data_member_location: 136
 <2><2f4>: Abbrev Number: 7 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x3983): tx_thread_created_previous
    <2f9>   DW_AT_decl_file   : 3
    <2fa>   DW_AT_decl_line   : 443
    <2fc>   DW_AT_decl_column : 26
    <2fd>   DW_AT_type        : <0x373>
    <301>   DW_AT_data_member_location: 140
 <2><302>: Abbrev Number: 7 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x1983): tx_thread_filex_ptr
    <307>   DW_AT_decl_file   : 3
    <308>   DW_AT_decl_line   : 451
    <30a>   DW_AT_decl_column : 26
    <30b>   DW_AT_type        : <0x76>
    <30f>   DW_AT_data_member_location: 144
 <2><310>: Abbrev Number: 7 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x37f8): tx_thread_user_priority
    <315>   DW_AT_decl_file   : 3
    <316>   DW_AT_decl_line   : 457
    <318>   DW_AT_decl_column : 25
    <319>   DW_AT_type        : <0x97>
    <31d>   DW_AT_data_member_location: 148
 <2><31e>: Abbrev Number: 7 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <323>   DW_AT_decl_file   : 3
    <324>   DW_AT_decl_line   : 458
    <326>   DW_AT_decl_column : 25
    <327>   DW_AT_type        : <0x97>
    <32b>   DW_AT_data_member_location: 152
 <2><32c>: Abbrev Number: 7 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x6096): tx_thread_inherit_priority
    <331>   DW_AT_decl_file   : 3
    <332>   DW_AT_decl_line   : 459
    <334>   DW_AT_decl_column : 25
    <335>   DW_AT_type        : <0x97>
    <339>   DW_AT_data_member_location: 156
 <2><33a>: Abbrev Number: 7 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x1875): tx_thread_owned_mutex_count
    <33f>   DW_AT_decl_file   : 3
    <340>   DW_AT_decl_line   : 462
    <342>   DW_AT_decl_column : 25
    <343>   DW_AT_type        : <0x97>
    <347>   DW_AT_data_member_location: 160
 <2><348>: Abbrev Number: 7 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x5405): tx_thread_owned_mutex_list
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 464
    <350>   DW_AT_decl_column : 26
    <351>   DW_AT_type        : <0x454>
    <355>   DW_AT_data_member_location: 164
 <2><356>: Abbrev Number: 7 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x257a): tx_thread_stack_highest_ptr
    <35b>   DW_AT_decl_file   : 3
    <35c>   DW_AT_decl_line   : 504
    <35e>   DW_AT_decl_column : 26
    <35f>   DW_AT_type        : <0x76>
    <363>   DW_AT_data_member_location: 168
 <2><364>: Abbrev Number: 7 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x1601): tx_thread_suspension_sequence
    <369>   DW_AT_decl_file   : 3
    <36a>   DW_AT_decl_line   : 531
    <36c>   DW_AT_decl_column : 25
    <36d>   DW_AT_type        : <0xa3>
    <371>   DW_AT_data_member_location: 172
 <2><372>: Abbrev Number: 0
 <1><373>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <374>   DW_AT_byte_size   : 4
    <375>   DW_AT_type        : <0x150>
 <1><379>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <37a>   DW_AT_prototyped  : 1
    <37a>   DW_AT_sibling     : <0x389>
 <2><37e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <37f>   DW_AT_type        : <0x373>
 <2><383>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <384>   DW_AT_type        : <0xa3>
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <38a>   DW_AT_byte_size   : 4
    <38b>   DW_AT_type        : <0x379>
 <1><38f>: Abbrev Number: 6 (DW_TAG_structure_type)
    <390>   DW_AT_name        : (indirect string, offset: 0x1d74): TX_MUTEX_STRUCT
    <394>   DW_AT_byte_size   : 52
    <395>   DW_AT_decl_file   : 3
    <396>   DW_AT_decl_line   : 787
    <398>   DW_AT_decl_column : 16
    <399>   DW_AT_sibling     : <0x454>
 <2><39d>: Abbrev Number: 7 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x4b07): tx_mutex_id
    <3a2>   DW_AT_decl_file   : 3
    <3a3>   DW_AT_decl_line   : 791
    <3a5>   DW_AT_decl_column : 25
    <3a6>   DW_AT_type        : <0xa3>
    <3aa>   DW_AT_data_member_location: 0
 <2><3ab>: Abbrev Number: 7 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x71d0): tx_mutex_name
    <3b0>   DW_AT_decl_file   : 3
    <3b1>   DW_AT_decl_line   : 794
    <3b3>   DW_AT_decl_column : 26
    <3b4>   DW_AT_type        : <0x14a>
    <3b8>   DW_AT_data_member_location: 4
 <2><3b9>: Abbrev Number: 7 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x10a1): tx_mutex_ownership_count
    <3be>   DW_AT_decl_file   : 3
    <3bf>   DW_AT_decl_line   : 797
    <3c1>   DW_AT_decl_column : 25
    <3c2>   DW_AT_type        : <0x97>
    <3c6>   DW_AT_data_member_location: 8
 <2><3c7>: Abbrev Number: 7 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x5676): tx_mutex_owner
    <3cc>   DW_AT_decl_file   : 3
    <3cd>   DW_AT_decl_line   : 801
    <3cf>   DW_AT_decl_column : 26
    <3d0>   DW_AT_type        : <0x545>
    <3d4>   DW_AT_data_member_location: 12
 <2><3d5>: Abbrev Number: 7 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xa30a): tx_mutex_inherit
    <3da>   DW_AT_decl_file   : 3
    <3db>   DW_AT_decl_line   : 805
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x97>
    <3e2>   DW_AT_data_member_location: 16
 <2><3e3>: Abbrev Number: 7 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x63ea): tx_mutex_original_priority
    <3e8>   DW_AT_decl_file   : 3
    <3e9>   DW_AT_decl_line   : 808
    <3eb>   DW_AT_decl_column : 25
    <3ec>   DW_AT_type        : <0x97>
    <3f0>   DW_AT_data_member_location: 20
 <2><3f1>: Abbrev Number: 7 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x170f): tx_mutex_suspension_list
    <3f6>   DW_AT_decl_file   : 3
    <3f7>   DW_AT_decl_line   : 813
    <3f9>   DW_AT_decl_column : 26
    <3fa>   DW_AT_type        : <0x373>
    <3fe>   DW_AT_data_member_location: 24
 <2><3ff>: Abbrev Number: 7 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x78c5): tx_mutex_suspended_count
    <404>   DW_AT_decl_file   : 3
    <405>   DW_AT_decl_line   : 814
    <407>   DW_AT_decl_column : 25
    <408>   DW_AT_type        : <0x97>
    <40c>   DW_AT_data_member_location: 28
 <2><40d>: Abbrev Number: 7 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x82a5): tx_mutex_created_next
    <412>   DW_AT_decl_file   : 3
    <413>   DW_AT_decl_line   : 818
    <415>   DW_AT_decl_column : 26
    <416>   DW_AT_type        : <0x454>
    <41a>   DW_AT_data_member_location: 32
 <2><41b>: Abbrev Number: 7 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x777): tx_mutex_created_previous
    <420>   DW_AT_decl_file   : 3
    <421>   DW_AT_decl_line   : 819
    <423>   DW_AT_decl_column : 26
    <424>   DW_AT_type        : <0x454>
    <428>   DW_AT_data_member_location: 36
 <2><429>: Abbrev Number: 7 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x231e): tx_mutex_highest_priority_waiting
    <42e>   DW_AT_decl_file   : 3
    <42f>   DW_AT_decl_line   : 823
    <431>   DW_AT_decl_column : 25
    <432>   DW_AT_type        : <0x97>
    <436>   DW_AT_data_member_location: 40
 <2><437>: Abbrev Number: 7 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x92d8): tx_mutex_owned_next
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 827
    <43f>   DW_AT_decl_column : 26
    <440>   DW_AT_type        : <0x454>
    <444>   DW_AT_data_member_location: 44
 <2><445>: Abbrev Number: 7 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0xa118): tx_mutex_owned_previous
    <44a>   DW_AT_decl_file   : 3
    <44b>   DW_AT_decl_line   : 828
    <44d>   DW_AT_decl_column : 26
    <44e>   DW_AT_type        : <0x454>
    <452>   DW_AT_data_member_location: 48
 <2><453>: Abbrev Number: 0
 <1><454>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <455>   DW_AT_byte_size   : 4
    <456>   DW_AT_type        : <0x38f>
 <1><45a>: Abbrev Number: 11 (DW_TAG_typedef)
    <45b>   DW_AT_name        : (indirect string, offset: 0x6e1a): TX_THREAD
    <45f>   DW_AT_decl_file   : 3
    <460>   DW_AT_decl_line   : 539
    <462>   DW_AT_decl_column : 3
    <463>   DW_AT_type        : <0x150>
 <1><467>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <468>   DW_AT_byte_size   : 4
    <469>   DW_AT_type        : <0x8b>
 <1><46d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <46e>   DW_AT_name        : (indirect string, offset: 0x48ba): TX_BYTE_POOL_STRUCT
    <472>   DW_AT_byte_size   : 52
    <473>   DW_AT_decl_file   : 3
    <474>   DW_AT_decl_line   : 622
    <476>   DW_AT_decl_column : 16
    <477>   DW_AT_sibling     : <0x532>
 <2><47b>: Abbrev Number: 7 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x1865): tx_byte_pool_id
    <480>   DW_AT_decl_file   : 3
    <481>   DW_AT_decl_line   : 626
    <483>   DW_AT_decl_column : 25
    <484>   DW_AT_type        : <0xa3>
    <488>   DW_AT_data_member_location: 0
 <2><489>: Abbrev Number: 7 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x6451): tx_byte_pool_name
    <48e>   DW_AT_decl_file   : 3
    <48f>   DW_AT_decl_line   : 629
    <491>   DW_AT_decl_column : 26
    <492>   DW_AT_type        : <0x14a>
    <496>   DW_AT_data_member_location: 4
 <2><497>: Abbrev Number: 7 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x791): tx_byte_pool_available
    <49c>   DW_AT_decl_file   : 3
    <49d>   DW_AT_decl_line   : 632
    <49f>   DW_AT_decl_column : 25
    <4a0>   DW_AT_type        : <0xa3>
    <4a4>   DW_AT_data_member_location: 8
 <2><4a5>: Abbrev Number: 7 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x7d21): tx_byte_pool_fragments
    <4aa>   DW_AT_decl_file   : 3
    <4ab>   DW_AT_decl_line   : 635
    <4ad>   DW_AT_decl_column : 25
    <4ae>   DW_AT_type        : <0x97>
    <4b2>   DW_AT_data_member_location: 12
 <2><4b3>: Abbrev Number: 7 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x4282): tx_byte_pool_list
    <4b8>   DW_AT_decl_file   : 3
    <4b9>   DW_AT_decl_line   : 638
    <4bb>   DW_AT_decl_column : 26
    <4bc>   DW_AT_type        : <0x467>
    <4c0>   DW_AT_data_member_location: 16
 <2><4c1>: Abbrev Number: 7 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x6d30): tx_byte_pool_search
    <4c6>   DW_AT_decl_file   : 3
    <4c7>   DW_AT_decl_line   : 642
    <4c9>   DW_AT_decl_column : 26
    <4ca>   DW_AT_type        : <0x467>
    <4ce>   DW_AT_data_member_location: 20
 <2><4cf>: Abbrev Number: 7 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x7d0e): tx_byte_pool_start
    <4d4>   DW_AT_decl_file   : 3
    <4d5>   DW_AT_decl_line   : 645
    <4d7>   DW_AT_decl_column : 26
    <4d8>   DW_AT_type        : <0x467>
    <4dc>   DW_AT_data_member_location: 24
 <2><4dd>: Abbrev Number: 7 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x16de): tx_byte_pool_size
    <4e2>   DW_AT_decl_file   : 3
    <4e3>   DW_AT_decl_line   : 648
    <4e5>   DW_AT_decl_column : 25
    <4e6>   DW_AT_type        : <0xa3>
    <4ea>   DW_AT_data_member_location: 28
 <2><4eb>: Abbrev Number: 7 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x421e): tx_byte_pool_owner
    <4f0>   DW_AT_decl_file   : 3
    <4f1>   DW_AT_decl_line   : 654
    <4f3>   DW_AT_decl_column : 26
    <4f4>   DW_AT_type        : <0x373>
    <4f8>   DW_AT_data_member_location: 32
 <2><4f9>: Abbrev Number: 7 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x9047): tx_byte_pool_suspension_list
    <4fe>   DW_AT_decl_file   : 3
    <4ff>   DW_AT_decl_line   : 659
    <501>   DW_AT_decl_column : 26
    <502>   DW_AT_type        : <0x373>
    <506>   DW_AT_data_member_location: 36
 <2><507>: Abbrev Number: 7 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x77b4): tx_byte_pool_suspended_count
    <50c>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 660
    <50f>   DW_AT_decl_column : 25
    <510>   DW_AT_type        : <0x97>
    <514>   DW_AT_data_member_location: 40
 <2><515>: Abbrev Number: 7 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x629): tx_byte_pool_created_next
    <51a>   DW_AT_decl_file   : 3
    <51b>   DW_AT_decl_line   : 664
    <51d>   DW_AT_decl_column : 26
    <51e>   DW_AT_type        : <0x532>
    <522>   DW_AT_data_member_location: 44
 <2><523>: Abbrev Number: 7 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0x7d38): tx_byte_pool_created_previous
    <528>   DW_AT_decl_file   : 3
    <529>   DW_AT_decl_line   : 665
    <52b>   DW_AT_decl_column : 26
    <52c>   DW_AT_type        : <0x532>
    <530>   DW_AT_data_member_location: 48
 <2><531>: Abbrev Number: 0
 <1><532>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <533>   DW_AT_byte_size   : 4
    <534>   DW_AT_type        : <0x46d>
 <1><538>: Abbrev Number: 11 (DW_TAG_typedef)
    <539>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <53d>   DW_AT_decl_file   : 3
    <53e>   DW_AT_decl_line   : 696
    <540>   DW_AT_decl_column : 3
    <541>   DW_AT_type        : <0x46d>
 <1><545>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <546>   DW_AT_byte_size   : 4
    <547>   DW_AT_type        : <0x45a>
 <1><54b>: Abbrev Number: 12 (DW_TAG_array_type)
    <54c>   DW_AT_type        : <0x8b>
    <550>   DW_AT_sibling     : <0x55c>
 <2><554>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <555>   DW_AT_type        : <0x29>
    <559>   DW_AT_upper_bound : 1023
 <2><55b>: Abbrev Number: 0
 <1><55c>: Abbrev Number: 14 (DW_TAG_variable)
    <55d>   DW_AT_name        : (indirect string, offset: 0x9caf): tx_byte_pool_buffer
    <561>   DW_AT_decl_file   : 1
    <562>   DW_AT_decl_line   : 49
    <563>   DW_AT_decl_column : 14
    <564>   DW_AT_type        : <0x54b>
    <568>   DW_AT_location    : 5 byte block: 3 8 2 0 20 	(DW_OP_addr: 20000208)
 <1><56e>: Abbrev Number: 14 (DW_TAG_variable)
    <56f>   DW_AT_name        : (indirect string, offset: 0x2068): tx_app_byte_pool
    <573>   DW_AT_decl_file   : 1
    <574>   DW_AT_decl_line   : 50
    <575>   DW_AT_decl_column : 21
    <576>   DW_AT_type        : <0x538>
    <57a>   DW_AT_location    : 5 byte block: 3 8 6 0 20 	(DW_OP_addr: 20000608)
 <1><580>: Abbrev Number: 15 (DW_TAG_subprogram)
    <581>   DW_AT_external    : 1
    <581>   DW_AT_name        : (indirect string, offset: 0x6d7d): App_ThreadX_Init
    <585>   DW_AT_decl_file   : 4
    <586>   DW_AT_decl_line   : 52
    <587>   DW_AT_decl_column : 6
    <588>   DW_AT_prototyped  : 1
    <588>   DW_AT_type        : <0x97>
    <58c>   DW_AT_declaration : 1
    <58c>   DW_AT_sibling     : <0x596>
 <2><590>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x76>
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 16 (DW_TAG_subprogram)
    <597>   DW_AT_external    : 1
    <597>   DW_AT_name        : (indirect string, offset: 0x6195): _txe_byte_pool_create
    <59b>   DW_AT_decl_file   : 3
    <59c>   DW_AT_decl_line   : 1435
    <59e>   DW_AT_decl_column : 13
    <59f>   DW_AT_prototyped  : 1
    <59f>   DW_AT_type        : <0x97>
    <5a3>   DW_AT_declaration : 1
    <5a3>   DW_AT_sibling     : <0x5c1>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5a8>   DW_AT_type        : <0x5c1>
 <2><5ac>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5ad>   DW_AT_type        : <0x14a>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b2>   DW_AT_type        : <0x76>
 <2><5b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_type        : <0xa3>
 <2><5bb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5bc>   DW_AT_type        : <0x97>
 <2><5c0>: Abbrev Number: 0
 <1><5c1>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <5c2>   DW_AT_byte_size   : 4
    <5c3>   DW_AT_type        : <0x538>
 <1><5c7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <5c8>   DW_AT_external    : 1
    <5c8>   DW_AT_name        : (indirect string, offset: 0x4063): tx_application_define
    <5cc>   DW_AT_decl_file   : 1
    <5cd>   DW_AT_decl_line   : 66
    <5ce>   DW_AT_decl_column : 6
    <5cf>   DW_AT_prototyped  : 1
    <5cf>   DW_AT_low_pc      : 0x8001278
    <5d3>   DW_AT_high_pc     : 0x40
    <5d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d9>   DW_AT_GNU_all_tail_call_sites: 1
 <2><5d9>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5da>   DW_AT_name        : (indirect string, offset: 0x9731): first_unused_memory
    <5de>   DW_AT_decl_file   : 1
    <5df>   DW_AT_decl_line   : 66
    <5e0>   DW_AT_decl_column : 34
    <5e1>   DW_AT_type        : <0x76>
    <5e5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5e8>: Abbrev Number: 14 (DW_TAG_variable)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x42b2): memory_ptr
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 72
    <5ef>   DW_AT_decl_column : 9
    <5f0>   DW_AT_type        : <0x76>
    <5f4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5f7>: Abbrev Number: 0
 <1><5f8>: Abbrev Number: 0
  Compilation Unit @ offset 0x5f9:
   Length:        0xdc2 (32-bit)
   Version:       4
   Abbrev Offset: 0x109
   Pointer Size:  4
 <0><604>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <605>   DW_AT_producer    : (indirect string, offset: 0x5b12): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <609>   DW_AT_language    : 12	(ANSI C99)
    <60a>   DW_AT_name        : (indirect string, offset: 0x30105): ../Core/Src/app_threadx.c
    <60e>   DW_AT_comp_dir    : (indirect string, offset: 0xa29b): C:/Users/david/Documents/GitHub/MotorControl/Debug
    <612>   DW_AT_ranges      : 0x10
    <616>   DW_AT_low_pc      : 0x0
    <61a>   DW_AT_stmt_list   : 0x704
    <61e>   DW_AT_GNU_macros  : 0x20ef
 <1><622>: Abbrev Number: 2 (DW_TAG_base_type)
    <623>   DW_AT_byte_size   : 4
    <624>   DW_AT_encoding    : 7	(unsigned)
    <625>   DW_AT_name        : (indirect string, offset: 0x2701): unsigned int
 <1><629>: Abbrev Number: 3 (DW_TAG_base_type)
    <62a>   DW_AT_byte_size   : 4
    <62b>   DW_AT_encoding    : 5	(signed)
    <62c>   DW_AT_name        : int
 <1><630>: Abbrev Number: 2 (DW_TAG_base_type)
    <631>   DW_AT_byte_size   : 8
    <632>   DW_AT_encoding    : 5	(signed)
    <633>   DW_AT_name        : (indirect string, offset: 0x5e29): long long int
 <1><637>: Abbrev Number: 2 (DW_TAG_base_type)
    <638>   DW_AT_byte_size   : 8
    <639>   DW_AT_encoding    : 4	(float)
    <63a>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><63e>: Abbrev Number: 2 (DW_TAG_base_type)
    <63f>   DW_AT_byte_size   : 1
    <640>   DW_AT_encoding    : 6	(signed char)
    <641>   DW_AT_name        : (indirect string, offset: 0x978): signed char
 <1><645>: Abbrev Number: 4 (DW_TAG_typedef)
    <646>   DW_AT_name        : (indirect string, offset: 0x43af9): __uint8_t
    <64a>   DW_AT_decl_file   : 2
    <64b>   DW_AT_decl_line   : 43
    <64c>   DW_AT_decl_column : 24
    <64d>   DW_AT_type        : <0x651>
 <1><651>: Abbrev Number: 2 (DW_TAG_base_type)
    <652>   DW_AT_byte_size   : 1
    <653>   DW_AT_encoding    : 8	(unsigned char)
    <654>   DW_AT_name        : (indirect string, offset: 0x3b46): unsigned char
 <1><658>: Abbrev Number: 2 (DW_TAG_base_type)
    <659>   DW_AT_byte_size   : 2
    <65a>   DW_AT_encoding    : 5	(signed)
    <65b>   DW_AT_name        : (indirect string, offset: 0xbeb): short int
 <1><65f>: Abbrev Number: 4 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0xac125): __uint16_t
    <664>   DW_AT_decl_file   : 2
    <665>   DW_AT_decl_line   : 57
    <666>   DW_AT_decl_column : 25
    <667>   DW_AT_type        : <0x66b>
 <1><66b>: Abbrev Number: 2 (DW_TAG_base_type)
    <66c>   DW_AT_byte_size   : 2
    <66d>   DW_AT_encoding    : 7	(unsigned)
    <66e>   DW_AT_name        : (indirect string, offset: 0x7ae6): short unsigned int
 <1><672>: Abbrev Number: 2 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 4
    <674>   DW_AT_encoding    : 5	(signed)
    <675>   DW_AT_name        : (indirect string, offset: 0x7eef): long int
 <1><679>: Abbrev Number: 4 (DW_TAG_typedef)
    <67a>   DW_AT_name        : (indirect string, offset: 0x87eee): __uint32_t
    <67e>   DW_AT_decl_file   : 2
    <67f>   DW_AT_decl_line   : 79
    <680>   DW_AT_decl_column : 25
    <681>   DW_AT_type        : <0x685>
 <1><685>: Abbrev Number: 2 (DW_TAG_base_type)
    <686>   DW_AT_byte_size   : 4
    <687>   DW_AT_encoding    : 7	(unsigned)
    <688>   DW_AT_name        : (indirect string, offset: 0x1dd6): long unsigned int
 <1><68c>: Abbrev Number: 2 (DW_TAG_base_type)
    <68d>   DW_AT_byte_size   : 8
    <68e>   DW_AT_encoding    : 7	(unsigned)
    <68f>   DW_AT_name        : (indirect string, offset: 0x228c): long long unsigned int
 <1><693>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <694>   DW_AT_byte_size   : 4
 <1><695>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <696>   DW_AT_byte_size   : 4
    <697>   DW_AT_type        : <0x69b>
 <1><69b>: Abbrev Number: 2 (DW_TAG_base_type)
    <69c>   DW_AT_byte_size   : 1
    <69d>   DW_AT_encoding    : 8	(unsigned char)
    <69e>   DW_AT_name        : (indirect string, offset: 0x97f): char
 <1><6a2>: Abbrev Number: 7 (DW_TAG_const_type)
    <6a3>   DW_AT_type        : <0x69b>
 <1><6a7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6a8>   DW_AT_byte_size   : 4
    <6a9>   DW_AT_type        : <0x6a2>
 <1><6ad>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x9fa7): CHAR
    <6b2>   DW_AT_decl_file   : 3
    <6b3>   DW_AT_decl_line   : 108
    <6b4>   DW_AT_decl_column : 49
    <6b5>   DW_AT_type        : <0x69b>
 <1><6b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9fa6): UCHAR
    <6be>   DW_AT_decl_file   : 3
    <6bf>   DW_AT_decl_line   : 109
    <6c0>   DW_AT_decl_column : 49
    <6c1>   DW_AT_type        : <0x651>
 <1><6c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x6dfa): UINT
    <6ca>   DW_AT_decl_file   : 3
    <6cb>   DW_AT_decl_line   : 111
    <6cc>   DW_AT_decl_column : 49
    <6cd>   DW_AT_type        : <0x622>
 <1><6d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x415a): ULONG
    <6d6>   DW_AT_decl_file   : 3
    <6d7>   DW_AT_decl_line   : 113
    <6d8>   DW_AT_decl_column : 49
    <6d9>   DW_AT_type        : <0x685>
 <1><6dd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <6de>   DW_AT_name        : (indirect string, offset: 0x3aca): TX_TIMER_INTERNAL_STRUCT
    <6e2>   DW_AT_byte_size   : 28
    <6e3>   DW_AT_decl_file   : 4
    <6e4>   DW_AT_decl_line   : 285
    <6e6>   DW_AT_decl_column : 16
    <6e7>   DW_AT_sibling     : <0x74e>
 <2><6eb>: Abbrev Number: 9 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x5d3b): tx_timer_internal_remaining_ticks
    <6f0>   DW_AT_decl_file   : 4
    <6f1>   DW_AT_decl_line   : 289
    <6f3>   DW_AT_decl_column : 25
    <6f4>   DW_AT_type        : <0x6d1>
    <6f8>   DW_AT_data_member_location: 0
 <2><6f9>: Abbrev Number: 9 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xa7f8): tx_timer_internal_re_initialize_ticks
    <6fe>   DW_AT_decl_file   : 4
    <6ff>   DW_AT_decl_line   : 290
    <701>   DW_AT_decl_column : 25
    <702>   DW_AT_type        : <0x6d1>
    <706>   DW_AT_data_member_location: 4
 <2><707>: Abbrev Number: 9 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x6471): tx_timer_internal_timeout_function
    <70c>   DW_AT_decl_file   : 4
    <70d>   DW_AT_decl_line   : 293
    <70f>   DW_AT_decl_column : 27
    <710>   DW_AT_type        : <0x759>
    <714>   DW_AT_data_member_location: 8
 <2><715>: Abbrev Number: 9 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x9540): tx_timer_internal_timeout_param
    <71a>   DW_AT_decl_file   : 4
    <71b>   DW_AT_decl_line   : 294
    <71d>   DW_AT_decl_column : 25
    <71e>   DW_AT_type        : <0x6d1>
    <722>   DW_AT_data_member_location: 12
 <2><723>: Abbrev Number: 9 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x113f): tx_timer_internal_active_next
    <728>   DW_AT_decl_file   : 4
    <729>   DW_AT_decl_line   : 300
    <72b>   DW_AT_decl_column : 26
    <72c>   DW_AT_type        : <0x75f>
    <730>   DW_AT_data_member_location: 16
 <2><731>: Abbrev Number: 9 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0xa3d0): tx_timer_internal_active_previous
    <736>   DW_AT_decl_file   : 4
    <737>   DW_AT_decl_line   : 301
    <739>   DW_AT_decl_column : 26
    <73a>   DW_AT_type        : <0x75f>
    <73e>   DW_AT_data_member_location: 20
 <2><73f>: Abbrev Number: 9 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x5450): tx_timer_internal_list_head
    <744>   DW_AT_decl_file   : 4
    <745>   DW_AT_decl_line   : 305
    <747>   DW_AT_decl_column : 27
    <748>   DW_AT_type        : <0x765>
    <74c>   DW_AT_data_member_location: 24
 <2><74d>: Abbrev Number: 0
 <1><74e>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <74f>   DW_AT_prototyped  : 1
    <74f>   DW_AT_sibling     : <0x759>
 <2><753>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <754>   DW_AT_type        : <0x6d1>
 <2><758>: Abbrev Number: 0
 <1><759>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <75a>   DW_AT_byte_size   : 4
    <75b>   DW_AT_type        : <0x74e>
 <1><75f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <760>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x6dd>
 <1><765>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <767>   DW_AT_type        : <0x75f>
 <1><76b>: Abbrev Number: 12 (DW_TAG_typedef)
    <76c>   DW_AT_name        : (indirect string, offset: 0x8d68): TX_TIMER_INTERNAL
    <770>   DW_AT_decl_file   : 4
    <771>   DW_AT_decl_line   : 310
    <773>   DW_AT_decl_column : 3
    <774>   DW_AT_type        : <0x6dd>
 <1><778>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <779>   DW_AT_byte_size   : 4
    <77a>   DW_AT_type        : <0x6ad>
 <1><77e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <77f>   DW_AT_name        : (indirect string, offset: 0x75b3): TX_THREAD_STRUCT
    <783>   DW_AT_byte_size   : 176
    <784>   DW_AT_decl_file   : 4
    <785>   DW_AT_decl_line   : 369
    <787>   DW_AT_decl_column : 16
    <788>   DW_AT_sibling     : <0x9a1>
 <2><78c>: Abbrev Number: 9 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x40a0): tx_thread_id
    <791>   DW_AT_decl_file   : 4
    <792>   DW_AT_decl_line   : 376
    <794>   DW_AT_decl_column : 25
    <795>   DW_AT_type        : <0x6d1>
    <799>   DW_AT_data_member_location: 0
 <2><79a>: Abbrev Number: 9 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x7534): tx_thread_run_count
    <79f>   DW_AT_decl_file   : 4
    <7a0>   DW_AT_decl_line   : 377
    <7a2>   DW_AT_decl_column : 25
    <7a3>   DW_AT_type        : <0x6d1>
    <7a7>   DW_AT_data_member_location: 4
 <2><7a8>: Abbrev Number: 9 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x2ccf): tx_thread_stack_ptr
    <7ad>   DW_AT_decl_file   : 4
    <7ae>   DW_AT_decl_line   : 378
    <7b0>   DW_AT_decl_column : 26
    <7b1>   DW_AT_type        : <0x693>
    <7b5>   DW_AT_data_member_location: 8
 <2><7b6>: Abbrev Number: 9 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0x6fd5): tx_thread_stack_start
    <7bb>   DW_AT_decl_file   : 4
    <7bc>   DW_AT_decl_line   : 379
    <7be>   DW_AT_decl_column : 26
    <7bf>   DW_AT_type        : <0x693>
    <7c3>   DW_AT_data_member_location: 12
 <2><7c4>: Abbrev Number: 9 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x9064): tx_thread_stack_end
    <7c9>   DW_AT_decl_file   : 4
    <7ca>   DW_AT_decl_line   : 380
    <7cc>   DW_AT_decl_column : 26
    <7cd>   DW_AT_type        : <0x693>
    <7d1>   DW_AT_data_member_location: 16
 <2><7d2>: Abbrev Number: 9 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x9106): tx_thread_stack_size
    <7d7>   DW_AT_decl_file   : 4
    <7d8>   DW_AT_decl_line   : 381
    <7da>   DW_AT_decl_column : 25
    <7db>   DW_AT_type        : <0x6d1>
    <7df>   DW_AT_data_member_location: 20
 <2><7e0>: Abbrev Number: 9 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xda544): tx_thread_time_slice
    <7e5>   DW_AT_decl_file   : 4
    <7e6>   DW_AT_decl_line   : 382
    <7e8>   DW_AT_decl_column : 25
    <7e9>   DW_AT_type        : <0x6d1>
    <7ed>   DW_AT_data_member_location: 24
 <2><7ee>: Abbrev Number: 9 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0x3d33): tx_thread_new_time_slice
    <7f3>   DW_AT_decl_file   : 4
    <7f4>   DW_AT_decl_line   : 383
    <7f6>   DW_AT_decl_column : 25
    <7f7>   DW_AT_type        : <0x6d1>
    <7fb>   DW_AT_data_member_location: 28
 <2><7fc>: Abbrev Number: 9 (DW_TAG_member)
    <7fd>   DW_AT_name        : (indirect string, offset: 0x6c1b): tx_thread_ready_next
    <801>   DW_AT_decl_file   : 4
    <802>   DW_AT_decl_line   : 387
    <804>   DW_AT_decl_column : 26
    <805>   DW_AT_type        : <0x9a1>
    <809>   DW_AT_data_member_location: 32
 <2><80a>: Abbrev Number: 9 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0xbb4): tx_thread_ready_previous
    <80f>   DW_AT_decl_file   : 4
    <810>   DW_AT_decl_line   : 388
    <812>   DW_AT_decl_column : 26
    <813>   DW_AT_type        : <0x9a1>
    <817>   DW_AT_data_member_location: 36
 <2><818>: Abbrev Number: 9 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x7cff): tx_thread_name
    <81d>   DW_AT_decl_file   : 4
    <81e>   DW_AT_decl_line   : 396
    <820>   DW_AT_decl_column : 26
    <821>   DW_AT_type        : <0x778>
    <825>   DW_AT_data_member_location: 40
 <2><826>: Abbrev Number: 9 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0x38ec): tx_thread_priority
    <82b>   DW_AT_decl_file   : 4
    <82c>   DW_AT_decl_line   : 397
    <82e>   DW_AT_decl_column : 25
    <82f>   DW_AT_type        : <0x6c5>
    <833>   DW_AT_data_member_location: 44
 <2><834>: Abbrev Number: 9 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x129f): tx_thread_state
    <839>   DW_AT_decl_file   : 4
    <83a>   DW_AT_decl_line   : 398
    <83c>   DW_AT_decl_column : 25
    <83d>   DW_AT_type        : <0x6c5>
    <841>   DW_AT_data_member_location: 48
 <2><842>: Abbrev Number: 9 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x9664): tx_thread_delayed_suspend
    <847>   DW_AT_decl_file   : 4
    <848>   DW_AT_decl_line   : 399
    <84a>   DW_AT_decl_column : 25
    <84b>   DW_AT_type        : <0x6c5>
    <84f>   DW_AT_data_member_location: 52
 <2><850>: Abbrev Number: 9 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x66f5): tx_thread_suspending
    <855>   DW_AT_decl_file   : 4
    <856>   DW_AT_decl_line   : 400
    <858>   DW_AT_decl_column : 25
    <859>   DW_AT_type        : <0x6c5>
    <85d>   DW_AT_data_member_location: 56
 <2><85e>: Abbrev Number: 9 (DW_TAG_member)
    <85f>   DW_AT_name        : (indirect string, offset: 0x27ac): tx_thread_preempt_threshold
    <863>   DW_AT_decl_file   : 4
    <864>   DW_AT_decl_line   : 401
    <866>   DW_AT_decl_column : 25
    <867>   DW_AT_type        : <0x6c5>
    <86b>   DW_AT_data_member_location: 60
 <2><86c>: Abbrev Number: 9 (DW_TAG_member)
    <86d>   DW_AT_name        : (indirect string, offset: 0x51b7): tx_thread_schedule_hook
    <871>   DW_AT_decl_file   : 4
    <872>   DW_AT_decl_line   : 406
    <874>   DW_AT_decl_column : 27
    <875>   DW_AT_type        : <0x9b7>
    <879>   DW_AT_data_member_location: 64
 <2><87a>: Abbrev Number: 9 (DW_TAG_member)
    <87b>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <87f>   DW_AT_decl_file   : 4
    <880>   DW_AT_decl_line   : 414
    <882>   DW_AT_decl_column : 27
    <883>   DW_AT_type        : <0x759>
    <887>   DW_AT_data_member_location: 68
 <2><888>: Abbrev Number: 9 (DW_TAG_member)
    <889>   DW_AT_name        : (indirect string, offset: 0xe94): tx_thread_entry_parameter
    <88d>   DW_AT_decl_file   : 4
    <88e>   DW_AT_decl_line   : 415
    <890>   DW_AT_decl_column : 25
    <891>   DW_AT_type        : <0x6d1>
    <895>   DW_AT_data_member_location: 72
 <2><896>: Abbrev Number: 9 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0x3aba): tx_thread_timer
    <89b>   DW_AT_decl_file   : 4
    <89c>   DW_AT_decl_line   : 419
    <89e>   DW_AT_decl_column : 25
    <89f>   DW_AT_type        : <0x76b>
    <8a3>   DW_AT_data_member_location: 76
 <2><8a4>: Abbrev Number: 9 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x71ac): tx_thread_suspend_cleanup
    <8a9>   DW_AT_decl_file   : 4
    <8aa>   DW_AT_decl_line   : 425
    <8ac>   DW_AT_decl_column : 27
    <8ad>   DW_AT_type        : <0x9b7>
    <8b1>   DW_AT_data_member_location: 104
 <2><8b2>: Abbrev Number: 9 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x7056): tx_thread_suspend_control_block
    <8b7>   DW_AT_decl_file   : 4
    <8b8>   DW_AT_decl_line   : 426
    <8ba>   DW_AT_decl_column : 26
    <8bb>   DW_AT_type        : <0x693>
    <8bf>   DW_AT_data_member_location: 108
 <2><8c0>: Abbrev Number: 9 (DW_TAG_member)
    <8c1>   DW_AT_name        : (indirect string, offset: 0x6c02): tx_thread_suspended_next
    <8c5>   DW_AT_decl_file   : 4
    <8c6>   DW_AT_decl_line   : 428
    <8c8>   DW_AT_decl_column : 26
    <8c9>   DW_AT_type        : <0x9a1>
    <8cd>   DW_AT_data_member_location: 112
 <2><8ce>: Abbrev Number: 9 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x4231): tx_thread_suspended_previous
    <8d3>   DW_AT_decl_file   : 4
    <8d4>   DW_AT_decl_line   : 429
    <8d6>   DW_AT_decl_column : 26
    <8d7>   DW_AT_type        : <0x9a1>
    <8db>   DW_AT_data_member_location: 116
 <2><8dc>: Abbrev Number: 9 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x76d4): tx_thread_suspend_info
    <8e1>   DW_AT_decl_file   : 4
    <8e2>   DW_AT_decl_line   : 430
    <8e4>   DW_AT_decl_column : 25
    <8e5>   DW_AT_type        : <0x6d1>
    <8e9>   DW_AT_data_member_location: 120
 <2><8ea>: Abbrev Number: 9 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x7e92): tx_thread_additional_suspend_info
    <8ef>   DW_AT_decl_file   : 4
    <8f0>   DW_AT_decl_line   : 431
    <8f2>   DW_AT_decl_column : 26
    <8f3>   DW_AT_type        : <0x693>
    <8f7>   DW_AT_data_member_location: 124
 <2><8f8>: Abbrev Number: 9 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0x23f5): tx_thread_suspend_option
    <8fd>   DW_AT_decl_file   : 4
    <8fe>   DW_AT_decl_line   : 432
    <900>   DW_AT_decl_column : 25
    <901>   DW_AT_type        : <0x6c5>
    <905>   DW_AT_data_member_location: 128
 <2><906>: Abbrev Number: 9 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x218d): tx_thread_suspend_status
    <90b>   DW_AT_decl_file   : 4
    <90c>   DW_AT_decl_line   : 433
    <90e>   DW_AT_decl_column : 25
    <90f>   DW_AT_type        : <0x6c5>
    <913>   DW_AT_data_member_location: 132
 <2><914>: Abbrev Number: 9 (DW_TAG_member)
    <915>   DW_AT_name        : (indirect string, offset: 0xbf5): tx_thread_created_next
    <919>   DW_AT_decl_file   : 4
    <91a>   DW_AT_decl_line   : 442
    <91c>   DW_AT_decl_column : 26
    <91d>   DW_AT_type        : <0x9a1>
    <921>   DW_AT_data_member_location: 136
 <2><922>: Abbrev Number: 9 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x3983): tx_thread_created_previous
    <927>   DW_AT_decl_file   : 4
    <928>   DW_AT_decl_line   : 443
    <92a>   DW_AT_decl_column : 26
    <92b>   DW_AT_type        : <0x9a1>
    <92f>   DW_AT_data_member_location: 140
 <2><930>: Abbrev Number: 9 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x1983): tx_thread_filex_ptr
    <935>   DW_AT_decl_file   : 4
    <936>   DW_AT_decl_line   : 451
    <938>   DW_AT_decl_column : 26
    <939>   DW_AT_type        : <0x693>
    <93d>   DW_AT_data_member_location: 144
 <2><93e>: Abbrev Number: 9 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x37f8): tx_thread_user_priority
    <943>   DW_AT_decl_file   : 4
    <944>   DW_AT_decl_line   : 457
    <946>   DW_AT_decl_column : 25
    <947>   DW_AT_type        : <0x6c5>
    <94b>   DW_AT_data_member_location: 148
 <2><94c>: Abbrev Number: 9 (DW_TAG_member)
    <94d>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <951>   DW_AT_decl_file   : 4
    <952>   DW_AT_decl_line   : 458
    <954>   DW_AT_decl_column : 25
    <955>   DW_AT_type        : <0x6c5>
    <959>   DW_AT_data_member_location: 152
 <2><95a>: Abbrev Number: 9 (DW_TAG_member)
    <95b>   DW_AT_name        : (indirect string, offset: 0x6096): tx_thread_inherit_priority
    <95f>   DW_AT_decl_file   : 4
    <960>   DW_AT_decl_line   : 459
    <962>   DW_AT_decl_column : 25
    <963>   DW_AT_type        : <0x6c5>
    <967>   DW_AT_data_member_location: 156
 <2><968>: Abbrev Number: 9 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0x1875): tx_thread_owned_mutex_count
    <96d>   DW_AT_decl_file   : 4
    <96e>   DW_AT_decl_line   : 462
    <970>   DW_AT_decl_column : 25
    <971>   DW_AT_type        : <0x6c5>
    <975>   DW_AT_data_member_location: 160
 <2><976>: Abbrev Number: 9 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0x5405): tx_thread_owned_mutex_list
    <97b>   DW_AT_decl_file   : 4
    <97c>   DW_AT_decl_line   : 464
    <97e>   DW_AT_decl_column : 26
    <97f>   DW_AT_type        : <0xa82>
    <983>   DW_AT_data_member_location: 164
 <2><984>: Abbrev Number: 9 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x257a): tx_thread_stack_highest_ptr
    <989>   DW_AT_decl_file   : 4
    <98a>   DW_AT_decl_line   : 504
    <98c>   DW_AT_decl_column : 26
    <98d>   DW_AT_type        : <0x693>
    <991>   DW_AT_data_member_location: 168
 <2><992>: Abbrev Number: 9 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x1601): tx_thread_suspension_sequence
    <997>   DW_AT_decl_file   : 4
    <998>   DW_AT_decl_line   : 531
    <99a>   DW_AT_decl_column : 25
    <99b>   DW_AT_type        : <0x6d1>
    <99f>   DW_AT_data_member_location: 172
 <2><9a0>: Abbrev Number: 0
 <1><9a1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9a2>   DW_AT_byte_size   : 4
    <9a3>   DW_AT_type        : <0x77e>
 <1><9a7>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <9a8>   DW_AT_prototyped  : 1
    <9a8>   DW_AT_sibling     : <0x9b7>
 <2><9ac>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <9ad>   DW_AT_type        : <0x9a1>
 <2><9b1>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <9b2>   DW_AT_type        : <0x6d1>
 <2><9b6>: Abbrev Number: 0
 <1><9b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9b8>   DW_AT_byte_size   : 4
    <9b9>   DW_AT_type        : <0x9a7>
 <1><9bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <9be>   DW_AT_name        : (indirect string, offset: 0x1d74): TX_MUTEX_STRUCT
    <9c2>   DW_AT_byte_size   : 52
    <9c3>   DW_AT_decl_file   : 4
    <9c4>   DW_AT_decl_line   : 787
    <9c6>   DW_AT_decl_column : 16
    <9c7>   DW_AT_sibling     : <0xa82>
 <2><9cb>: Abbrev Number: 9 (DW_TAG_member)
    <9cc>   DW_AT_name        : (indirect string, offset: 0x4b07): tx_mutex_id
    <9d0>   DW_AT_decl_file   : 4
    <9d1>   DW_AT_decl_line   : 791
    <9d3>   DW_AT_decl_column : 25
    <9d4>   DW_AT_type        : <0x6d1>
    <9d8>   DW_AT_data_member_location: 0
 <2><9d9>: Abbrev Number: 9 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x71d0): tx_mutex_name
    <9de>   DW_AT_decl_file   : 4
    <9df>   DW_AT_decl_line   : 794
    <9e1>   DW_AT_decl_column : 26
    <9e2>   DW_AT_type        : <0x778>
    <9e6>   DW_AT_data_member_location: 4
 <2><9e7>: Abbrev Number: 9 (DW_TAG_member)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x10a1): tx_mutex_ownership_count
    <9ec>   DW_AT_decl_file   : 4
    <9ed>   DW_AT_decl_line   : 797
    <9ef>   DW_AT_decl_column : 25
    <9f0>   DW_AT_type        : <0x6c5>
    <9f4>   DW_AT_data_member_location: 8
 <2><9f5>: Abbrev Number: 9 (DW_TAG_member)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x5676): tx_mutex_owner
    <9fa>   DW_AT_decl_file   : 4
    <9fb>   DW_AT_decl_line   : 801
    <9fd>   DW_AT_decl_column : 26
    <9fe>   DW_AT_type        : <0xb73>
    <a02>   DW_AT_data_member_location: 12
 <2><a03>: Abbrev Number: 9 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0xa30a): tx_mutex_inherit
    <a08>   DW_AT_decl_file   : 4
    <a09>   DW_AT_decl_line   : 805
    <a0b>   DW_AT_decl_column : 25
    <a0c>   DW_AT_type        : <0x6c5>
    <a10>   DW_AT_data_member_location: 16
 <2><a11>: Abbrev Number: 9 (DW_TAG_member)
    <a12>   DW_AT_name        : (indirect string, offset: 0x63ea): tx_mutex_original_priority
    <a16>   DW_AT_decl_file   : 4
    <a17>   DW_AT_decl_line   : 808
    <a19>   DW_AT_decl_column : 25
    <a1a>   DW_AT_type        : <0x6c5>
    <a1e>   DW_AT_data_member_location: 20
 <2><a1f>: Abbrev Number: 9 (DW_TAG_member)
    <a20>   DW_AT_name        : (indirect string, offset: 0x170f): tx_mutex_suspension_list
    <a24>   DW_AT_decl_file   : 4
    <a25>   DW_AT_decl_line   : 813
    <a27>   DW_AT_decl_column : 26
    <a28>   DW_AT_type        : <0x9a1>
    <a2c>   DW_AT_data_member_location: 24
 <2><a2d>: Abbrev Number: 9 (DW_TAG_member)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x78c5): tx_mutex_suspended_count
    <a32>   DW_AT_decl_file   : 4
    <a33>   DW_AT_decl_line   : 814
    <a35>   DW_AT_decl_column : 25
    <a36>   DW_AT_type        : <0x6c5>
    <a3a>   DW_AT_data_member_location: 28
 <2><a3b>: Abbrev Number: 9 (DW_TAG_member)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x82a5): tx_mutex_created_next
    <a40>   DW_AT_decl_file   : 4
    <a41>   DW_AT_decl_line   : 818
    <a43>   DW_AT_decl_column : 26
    <a44>   DW_AT_type        : <0xa82>
    <a48>   DW_AT_data_member_location: 32
 <2><a49>: Abbrev Number: 9 (DW_TAG_member)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x777): tx_mutex_created_previous
    <a4e>   DW_AT_decl_file   : 4
    <a4f>   DW_AT_decl_line   : 819
    <a51>   DW_AT_decl_column : 26
    <a52>   DW_AT_type        : <0xa82>
    <a56>   DW_AT_data_member_location: 36
 <2><a57>: Abbrev Number: 9 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0x231e): tx_mutex_highest_priority_waiting
    <a5c>   DW_AT_decl_file   : 4
    <a5d>   DW_AT_decl_line   : 823
    <a5f>   DW_AT_decl_column : 25
    <a60>   DW_AT_type        : <0x6c5>
    <a64>   DW_AT_data_member_location: 40
 <2><a65>: Abbrev Number: 9 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x92d8): tx_mutex_owned_next
    <a6a>   DW_AT_decl_file   : 4
    <a6b>   DW_AT_decl_line   : 827
    <a6d>   DW_AT_decl_column : 26
    <a6e>   DW_AT_type        : <0xa82>
    <a72>   DW_AT_data_member_location: 44
 <2><a73>: Abbrev Number: 9 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0xa118): tx_mutex_owned_previous
    <a78>   DW_AT_decl_file   : 4
    <a79>   DW_AT_decl_line   : 828
    <a7b>   DW_AT_decl_column : 26
    <a7c>   DW_AT_type        : <0xa82>
    <a80>   DW_AT_data_member_location: 48
 <2><a81>: Abbrev Number: 0
 <1><a82>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a83>   DW_AT_byte_size   : 4
    <a84>   DW_AT_type        : <0x9bd>
 <1><a88>: Abbrev Number: 12 (DW_TAG_typedef)
    <a89>   DW_AT_name        : (indirect string, offset: 0x6e1a): TX_THREAD
    <a8d>   DW_AT_decl_file   : 4
    <a8e>   DW_AT_decl_line   : 539
    <a90>   DW_AT_decl_column : 3
    <a91>   DW_AT_type        : <0x77e>
 <1><a95>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a96>   DW_AT_byte_size   : 4
    <a97>   DW_AT_type        : <0x6b9>
 <1><a9b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x48ba): TX_BYTE_POOL_STRUCT
    <aa0>   DW_AT_byte_size   : 52
    <aa1>   DW_AT_decl_file   : 4
    <aa2>   DW_AT_decl_line   : 622
    <aa4>   DW_AT_decl_column : 16
    <aa5>   DW_AT_sibling     : <0xb60>
 <2><aa9>: Abbrev Number: 9 (DW_TAG_member)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x1865): tx_byte_pool_id
    <aae>   DW_AT_decl_file   : 4
    <aaf>   DW_AT_decl_line   : 626
    <ab1>   DW_AT_decl_column : 25
    <ab2>   DW_AT_type        : <0x6d1>
    <ab6>   DW_AT_data_member_location: 0
 <2><ab7>: Abbrev Number: 9 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x6451): tx_byte_pool_name
    <abc>   DW_AT_decl_file   : 4
    <abd>   DW_AT_decl_line   : 629
    <abf>   DW_AT_decl_column : 26
    <ac0>   DW_AT_type        : <0x778>
    <ac4>   DW_AT_data_member_location: 4
 <2><ac5>: Abbrev Number: 9 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x791): tx_byte_pool_available
    <aca>   DW_AT_decl_file   : 4
    <acb>   DW_AT_decl_line   : 632
    <acd>   DW_AT_decl_column : 25
    <ace>   DW_AT_type        : <0x6d1>
    <ad2>   DW_AT_data_member_location: 8
 <2><ad3>: Abbrev Number: 9 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x7d21): tx_byte_pool_fragments
    <ad8>   DW_AT_decl_file   : 4
    <ad9>   DW_AT_decl_line   : 635
    <adb>   DW_AT_decl_column : 25
    <adc>   DW_AT_type        : <0x6c5>
    <ae0>   DW_AT_data_member_location: 12
 <2><ae1>: Abbrev Number: 9 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x4282): tx_byte_pool_list
    <ae6>   DW_AT_decl_file   : 4
    <ae7>   DW_AT_decl_line   : 638
    <ae9>   DW_AT_decl_column : 26
    <aea>   DW_AT_type        : <0xa95>
    <aee>   DW_AT_data_member_location: 16
 <2><aef>: Abbrev Number: 9 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0x6d30): tx_byte_pool_search
    <af4>   DW_AT_decl_file   : 4
    <af5>   DW_AT_decl_line   : 642
    <af7>   DW_AT_decl_column : 26
    <af8>   DW_AT_type        : <0xa95>
    <afc>   DW_AT_data_member_location: 20
 <2><afd>: Abbrev Number: 9 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x7d0e): tx_byte_pool_start
    <b02>   DW_AT_decl_file   : 4
    <b03>   DW_AT_decl_line   : 645
    <b05>   DW_AT_decl_column : 26
    <b06>   DW_AT_type        : <0xa95>
    <b0a>   DW_AT_data_member_location: 24
 <2><b0b>: Abbrev Number: 9 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x16de): tx_byte_pool_size
    <b10>   DW_AT_decl_file   : 4
    <b11>   DW_AT_decl_line   : 648
    <b13>   DW_AT_decl_column : 25
    <b14>   DW_AT_type        : <0x6d1>
    <b18>   DW_AT_data_member_location: 28
 <2><b19>: Abbrev Number: 9 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x421e): tx_byte_pool_owner
    <b1e>   DW_AT_decl_file   : 4
    <b1f>   DW_AT_decl_line   : 654
    <b21>   DW_AT_decl_column : 26
    <b22>   DW_AT_type        : <0x9a1>
    <b26>   DW_AT_data_member_location: 32
 <2><b27>: Abbrev Number: 9 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x9047): tx_byte_pool_suspension_list
    <b2c>   DW_AT_decl_file   : 4
    <b2d>   DW_AT_decl_line   : 659
    <b2f>   DW_AT_decl_column : 26
    <b30>   DW_AT_type        : <0x9a1>
    <b34>   DW_AT_data_member_location: 36
 <2><b35>: Abbrev Number: 9 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x77b4): tx_byte_pool_suspended_count
    <b3a>   DW_AT_decl_file   : 4
    <b3b>   DW_AT_decl_line   : 660
    <b3d>   DW_AT_decl_column : 25
    <b3e>   DW_AT_type        : <0x6c5>
    <b42>   DW_AT_data_member_location: 40
 <2><b43>: Abbrev Number: 9 (DW_TAG_member)
    <b44>   DW_AT_name        : (indirect string, offset: 0x629): tx_byte_pool_created_next
    <b48>   DW_AT_decl_file   : 4
    <b49>   DW_AT_decl_line   : 664
    <b4b>   DW_AT_decl_column : 26
    <b4c>   DW_AT_type        : <0xb60>
    <b50>   DW_AT_data_member_location: 44
 <2><b51>: Abbrev Number: 9 (DW_TAG_member)
    <b52>   DW_AT_name        : (indirect string, offset: 0x7d38): tx_byte_pool_created_previous
    <b56>   DW_AT_decl_file   : 4
    <b57>   DW_AT_decl_line   : 665
    <b59>   DW_AT_decl_column : 26
    <b5a>   DW_AT_type        : <0xb60>
    <b5e>   DW_AT_data_member_location: 48
 <2><b5f>: Abbrev Number: 0
 <1><b60>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b61>   DW_AT_byte_size   : 4
    <b62>   DW_AT_type        : <0xa9b>
 <1><b66>: Abbrev Number: 12 (DW_TAG_typedef)
    <b67>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <b6b>   DW_AT_decl_file   : 4
    <b6c>   DW_AT_decl_line   : 696
    <b6e>   DW_AT_decl_column : 3
    <b6f>   DW_AT_type        : <0xa9b>
 <1><b73>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b74>   DW_AT_byte_size   : 4
    <b75>   DW_AT_type        : <0xa88>
 <1><b79>: Abbrev Number: 4 (DW_TAG_typedef)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x43afb): uint8_t
    <b7e>   DW_AT_decl_file   : 5
    <b7f>   DW_AT_decl_line   : 24
    <b80>   DW_AT_decl_column : 19
    <b81>   DW_AT_type        : <0x645>
 <1><b85>: Abbrev Number: 7 (DW_TAG_const_type)
    <b86>   DW_AT_type        : <0xb79>
 <1><b8a>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8b>   DW_AT_name        : (indirect string, offset: 0xac127): uint16_t
    <b8f>   DW_AT_decl_file   : 5
    <b90>   DW_AT_decl_line   : 36
    <b91>   DW_AT_decl_column : 20
    <b92>   DW_AT_type        : <0x65f>
 <1><b96>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b97>   DW_AT_type        : <0xb8a>
 <1><b9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x87ef0): uint32_t
    <ba0>   DW_AT_decl_file   : 5
    <ba1>   DW_AT_decl_line   : 48
    <ba2>   DW_AT_decl_column : 20
    <ba3>   DW_AT_type        : <0x679>
 <1><ba7>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <ba8>   DW_AT_type        : <0xb9b>
 <1><bac>: Abbrev Number: 14 (DW_TAG_structure_type)
    <bad>   DW_AT_byte_size   : 24
    <bae>   DW_AT_decl_file   : 6
    <baf>   DW_AT_decl_line   : 362
    <bb1>   DW_AT_decl_column : 9
    <bb2>   DW_AT_sibling     : <0xc0a>
 <2><bb6>: Abbrev Number: 15 (DW_TAG_member)
    <bb7>   DW_AT_name        : CR
    <bba>   DW_AT_decl_file   : 6
    <bbb>   DW_AT_decl_line   : 364
    <bbd>   DW_AT_decl_column : 17
    <bbe>   DW_AT_type        : <0xba7>
    <bc2>   DW_AT_data_member_location: 0
 <2><bc3>: Abbrev Number: 9 (DW_TAG_member)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x2271f): NDTR
    <bc8>   DW_AT_decl_file   : 6
    <bc9>   DW_AT_decl_line   : 365
    <bcb>   DW_AT_decl_column : 17
    <bcc>   DW_AT_type        : <0xba7>
    <bd0>   DW_AT_data_member_location: 4
 <2><bd1>: Abbrev Number: 15 (DW_TAG_member)
    <bd2>   DW_AT_name        : PAR
    <bd6>   DW_AT_decl_file   : 6
    <bd7>   DW_AT_decl_line   : 366
    <bd9>   DW_AT_decl_column : 17
    <bda>   DW_AT_type        : <0xba7>
    <bde>   DW_AT_data_member_location: 8
 <2><bdf>: Abbrev Number: 9 (DW_TAG_member)
    <be0>   DW_AT_name        : (indirect string, offset: 0x5b937): M0AR
    <be4>   DW_AT_decl_file   : 6
    <be5>   DW_AT_decl_line   : 367
    <be7>   DW_AT_decl_column : 17
    <be8>   DW_AT_type        : <0xba7>
    <bec>   DW_AT_data_member_location: 12
 <2><bed>: Abbrev Number: 9 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0x76df4): M1AR
    <bf2>   DW_AT_decl_file   : 6
    <bf3>   DW_AT_decl_line   : 368
    <bf5>   DW_AT_decl_column : 17
    <bf6>   DW_AT_type        : <0xba7>
    <bfa>   DW_AT_data_member_location: 16
 <2><bfb>: Abbrev Number: 15 (DW_TAG_member)
    <bfc>   DW_AT_name        : FCR
    <c00>   DW_AT_decl_file   : 6
    <c01>   DW_AT_decl_line   : 369
    <c03>   DW_AT_decl_column : 17
    <c04>   DW_AT_type        : <0xba7>
    <c08>   DW_AT_data_member_location: 20
 <2><c09>: Abbrev Number: 0
 <1><c0a>: Abbrev Number: 12 (DW_TAG_typedef)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x235fb): DMA_Stream_TypeDef
    <c0f>   DW_AT_decl_file   : 6
    <c10>   DW_AT_decl_line   : 370
    <c12>   DW_AT_decl_column : 3
    <c13>   DW_AT_type        : <0xbac>
 <1><c17>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c18>   DW_AT_byte_size   : 28
    <c19>   DW_AT_decl_file   : 6
    <c1a>   DW_AT_decl_line   : 774
    <c1c>   DW_AT_decl_column : 9
    <c1d>   DW_AT_sibling     : <0xc82>
 <2><c21>: Abbrev Number: 15 (DW_TAG_member)
    <c22>   DW_AT_name        : SR
    <c25>   DW_AT_decl_file   : 6
    <c26>   DW_AT_decl_line   : 776
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0xba7>
    <c2d>   DW_AT_data_member_location: 0
 <2><c2e>: Abbrev Number: 15 (DW_TAG_member)
    <c2f>   DW_AT_name        : DR
    <c32>   DW_AT_decl_file   : 6
    <c33>   DW_AT_decl_line   : 777
    <c35>   DW_AT_decl_column : 17
    <c36>   DW_AT_type        : <0xba7>
    <c3a>   DW_AT_data_member_location: 4
 <2><c3b>: Abbrev Number: 15 (DW_TAG_member)
    <c3c>   DW_AT_name        : BRR
    <c40>   DW_AT_decl_file   : 6
    <c41>   DW_AT_decl_line   : 778
    <c43>   DW_AT_decl_column : 17
    <c44>   DW_AT_type        : <0xba7>
    <c48>   DW_AT_data_member_location: 8
 <2><c49>: Abbrev Number: 15 (DW_TAG_member)
    <c4a>   DW_AT_name        : CR1
    <c4e>   DW_AT_decl_file   : 6
    <c4f>   DW_AT_decl_line   : 779
    <c51>   DW_AT_decl_column : 17
    <c52>   DW_AT_type        : <0xba7>
    <c56>   DW_AT_data_member_location: 12
 <2><c57>: Abbrev Number: 15 (DW_TAG_member)
    <c58>   DW_AT_name        : CR2
    <c5c>   DW_AT_decl_file   : 6
    <c5d>   DW_AT_decl_line   : 780
    <c5f>   DW_AT_decl_column : 17
    <c60>   DW_AT_type        : <0xba7>
    <c64>   DW_AT_data_member_location: 16
 <2><c65>: Abbrev Number: 15 (DW_TAG_member)
    <c66>   DW_AT_name        : CR3
    <c6a>   DW_AT_decl_file   : 6
    <c6b>   DW_AT_decl_line   : 781
    <c6d>   DW_AT_decl_column : 17
    <c6e>   DW_AT_type        : <0xba7>
    <c72>   DW_AT_data_member_location: 20
 <2><c73>: Abbrev Number: 9 (DW_TAG_member)
    <c74>   DW_AT_name        : (indirect string, offset: 0x4121e): GTPR
    <c78>   DW_AT_decl_file   : 6
    <c79>   DW_AT_decl_line   : 782
    <c7b>   DW_AT_decl_column : 17
    <c7c>   DW_AT_type        : <0xba7>
    <c80>   DW_AT_data_member_location: 24
 <2><c81>: Abbrev Number: 0
 <1><c82>: Abbrev Number: 12 (DW_TAG_typedef)
    <c83>   DW_AT_name        : (indirect string, offset: 0x73640): USART_TypeDef
    <c87>   DW_AT_decl_file   : 6
    <c88>   DW_AT_decl_line   : 783
    <c8a>   DW_AT_decl_column : 3
    <c8b>   DW_AT_type        : <0xc17>
 <1><c8f>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <c90>   DW_AT_encoding    : 7	(unsigned)
    <c91>   DW_AT_byte_size   : 1
    <c92>   DW_AT_type        : <0x651>
    <c96>   DW_AT_decl_file   : 7
    <c97>   DW_AT_decl_line   : 39
    <c98>   DW_AT_decl_column : 1
    <c99>   DW_AT_sibling     : <0xcb6>
 <2><c9d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x4cc03): HAL_OK
    <ca2>   DW_AT_const_value : 0
 <2><ca3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x8593f): HAL_ERROR
    <ca8>   DW_AT_const_value : 1
 <2><ca9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <caa>   DW_AT_name        : (indirect string, offset: 0x2d78c): HAL_BUSY
    <cae>   DW_AT_const_value : 2
 <2><caf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x44250): HAL_TIMEOUT
    <cb4>   DW_AT_const_value : 3
 <2><cb5>: Abbrev Number: 0
 <1><cb6>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb7>   DW_AT_name        : (indirect string, offset: 0xd347): HAL_StatusTypeDef
    <cbb>   DW_AT_decl_file   : 7
    <cbc>   DW_AT_decl_line   : 44
    <cbd>   DW_AT_decl_column : 3
    <cbe>   DW_AT_type        : <0xc8f>
 <1><cc2>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <cc3>   DW_AT_encoding    : 7	(unsigned)
    <cc4>   DW_AT_byte_size   : 1
    <cc5>   DW_AT_type        : <0x651>
    <cc9>   DW_AT_decl_file   : 7
    <cca>   DW_AT_decl_line   : 50
    <ccb>   DW_AT_decl_column : 1
    <ccc>   DW_AT_sibling     : <0xcdd>
 <2><cd0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x9d03c): HAL_UNLOCKED
    <cd5>   DW_AT_const_value : 0
 <2><cd6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xd00ad): HAL_LOCKED
    <cdb>   DW_AT_const_value : 1
 <2><cdc>: Abbrev Number: 0
 <1><cdd>: Abbrev Number: 4 (DW_TAG_typedef)
    <cde>   DW_AT_name        : (indirect string, offset: 0x7e8b1): HAL_LockTypeDef
    <ce2>   DW_AT_decl_file   : 7
    <ce3>   DW_AT_decl_line   : 53
    <ce4>   DW_AT_decl_column : 3
    <ce5>   DW_AT_type        : <0xcc2>
 <1><ce9>: Abbrev Number: 18 (DW_TAG_structure_type)
    <cea>   DW_AT_byte_size   : 48
    <ceb>   DW_AT_decl_file   : 8
    <cec>   DW_AT_decl_line   : 48
    <ced>   DW_AT_decl_column : 9
    <cee>   DW_AT_sibling     : <0xd8f>
 <2><cf2>: Abbrev Number: 19 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0xd12fe): Channel
    <cf7>   DW_AT_decl_file   : 8
    <cf8>   DW_AT_decl_line   : 50
    <cf9>   DW_AT_decl_column : 12
    <cfa>   DW_AT_type        : <0xb9b>
    <cfe>   DW_AT_data_member_location: 0
 <2><cff>: Abbrev Number: 19 (DW_TAG_member)
    <d00>   DW_AT_name        : (indirect string, offset: 0x52ff4): Direction
    <d04>   DW_AT_decl_file   : 8
    <d05>   DW_AT_decl_line   : 53
    <d06>   DW_AT_decl_column : 12
    <d07>   DW_AT_type        : <0xb9b>
    <d0b>   DW_AT_data_member_location: 4
 <2><d0c>: Abbrev Number: 19 (DW_TAG_member)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x181b9): PeriphInc
    <d11>   DW_AT_decl_file   : 8
    <d12>   DW_AT_decl_line   : 57
    <d13>   DW_AT_decl_column : 12
    <d14>   DW_AT_type        : <0xb9b>
    <d18>   DW_AT_data_member_location: 8
 <2><d19>: Abbrev Number: 19 (DW_TAG_member)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x29f9b): MemInc
    <d1e>   DW_AT_decl_file   : 8
    <d1f>   DW_AT_decl_line   : 60
    <d20>   DW_AT_decl_column : 12
    <d21>   DW_AT_type        : <0xb9b>
    <d25>   DW_AT_data_member_location: 12
 <2><d26>: Abbrev Number: 19 (DW_TAG_member)
    <d27>   DW_AT_name        : (indirect string, offset: 0x6ba3f): PeriphDataAlignment
    <d2b>   DW_AT_decl_file   : 8
    <d2c>   DW_AT_decl_line   : 63
    <d2d>   DW_AT_decl_column : 12
    <d2e>   DW_AT_type        : <0xb9b>
    <d32>   DW_AT_data_member_location: 16
 <2><d33>: Abbrev Number: 19 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0xbcb89): MemDataAlignment
    <d38>   DW_AT_decl_file   : 8
    <d39>   DW_AT_decl_line   : 66
    <d3a>   DW_AT_decl_column : 12
    <d3b>   DW_AT_type        : <0xb9b>
    <d3f>   DW_AT_data_member_location: 20
 <2><d40>: Abbrev Number: 19 (DW_TAG_member)
    <d41>   DW_AT_name        : (indirect string, offset: 0xd5b08): Mode
    <d45>   DW_AT_decl_file   : 8
    <d46>   DW_AT_decl_line   : 69
    <d47>   DW_AT_decl_column : 12
    <d48>   DW_AT_type        : <0xb9b>
    <d4c>   DW_AT_data_member_location: 24
 <2><d4d>: Abbrev Number: 19 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0xd4e56): Priority
    <d52>   DW_AT_decl_file   : 8
    <d53>   DW_AT_decl_line   : 74
    <d54>   DW_AT_decl_column : 12
    <d55>   DW_AT_type        : <0xb9b>
    <d59>   DW_AT_data_member_location: 28
 <2><d5a>: Abbrev Number: 19 (DW_TAG_member)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x5ea43): FIFOMode
    <d5f>   DW_AT_decl_file   : 8
    <d60>   DW_AT_decl_line   : 77
    <d61>   DW_AT_decl_column : 12
    <d62>   DW_AT_type        : <0xb9b>
    <d66>   DW_AT_data_member_location: 32
 <2><d67>: Abbrev Number: 19 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0xa145b): FIFOThreshold
    <d6c>   DW_AT_decl_file   : 8
    <d6d>   DW_AT_decl_line   : 82
    <d6e>   DW_AT_decl_column : 12
    <d6f>   DW_AT_type        : <0xb9b>
    <d73>   DW_AT_data_member_location: 36
 <2><d74>: Abbrev Number: 19 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0x9f5fa): MemBurst
    <d79>   DW_AT_decl_file   : 8
    <d7a>   DW_AT_decl_line   : 85
    <d7b>   DW_AT_decl_column : 12
    <d7c>   DW_AT_type        : <0xb9b>
    <d80>   DW_AT_data_member_location: 40
 <2><d81>: Abbrev Number: 19 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0x4da27): PeriphBurst
    <d86>   DW_AT_decl_file   : 8
    <d87>   DW_AT_decl_line   : 91
    <d88>   DW_AT_decl_column : 12
    <d89>   DW_AT_type        : <0xb9b>
    <d8d>   DW_AT_data_member_location: 44
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d90>   DW_AT_name        : (indirect string, offset: 0x3f6ec): DMA_InitTypeDef
    <d94>   DW_AT_decl_file   : 8
    <d95>   DW_AT_decl_line   : 96
    <d96>   DW_AT_decl_column : 2
    <d97>   DW_AT_type        : <0xce9>
 <1><d9b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d9c>   DW_AT_encoding    : 7	(unsigned)
    <d9d>   DW_AT_byte_size   : 1
    <d9e>   DW_AT_type        : <0x651>
    <da2>   DW_AT_decl_file   : 8
    <da3>   DW_AT_decl_line   : 103
    <da4>   DW_AT_decl_column : 1
    <da5>   DW_AT_sibling     : <0xdce>
 <2><da9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0x9e525): HAL_DMA_STATE_RESET
    <dae>   DW_AT_const_value : 0
 <2><daf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x4092c): HAL_DMA_STATE_READY
    <db4>   DW_AT_const_value : 1
 <2><db5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x93336): HAL_DMA_STATE_BUSY
    <dba>   DW_AT_const_value : 2
 <2><dbb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0xb276f): HAL_DMA_STATE_TIMEOUT
    <dc0>   DW_AT_const_value : 3
 <2><dc1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xb3b40): HAL_DMA_STATE_ERROR
    <dc6>   DW_AT_const_value : 4
 <2><dc7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x37859): HAL_DMA_STATE_ABORT
    <dcc>   DW_AT_const_value : 5
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 4 (DW_TAG_typedef)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x76900): HAL_DMA_StateTypeDef
    <dd3>   DW_AT_decl_file   : 8
    <dd4>   DW_AT_decl_line   : 110
    <dd5>   DW_AT_decl_column : 2
    <dd6>   DW_AT_type        : <0xd9b>
 <1><dda>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <ddb>   DW_AT_type        : <0xdce>
 <1><ddf>: Abbrev Number: 20 (DW_TAG_structure_type)
    <de0>   DW_AT_name        : (indirect string, offset: 0xb2cb1): __DMA_HandleTypeDef
    <de4>   DW_AT_byte_size   : 96
    <de5>   DW_AT_decl_file   : 8
    <de6>   DW_AT_decl_line   : 138
    <de7>   DW_AT_decl_column : 16
    <de8>   DW_AT_sibling     : <0xea3>
 <2><dec>: Abbrev Number: 19 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0xc98b4): Instance
    <df1>   DW_AT_decl_file   : 8
    <df2>   DW_AT_decl_line   : 140
    <df3>   DW_AT_decl_column : 31
    <df4>   DW_AT_type        : <0xea3>
    <df8>   DW_AT_data_member_location: 0
 <2><df9>: Abbrev Number: 19 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0xd5481): Init
    <dfe>   DW_AT_decl_file   : 8
    <dff>   DW_AT_decl_line   : 142
    <e00>   DW_AT_decl_column : 30
    <e01>   DW_AT_type        : <0xd8f>
    <e05>   DW_AT_data_member_location: 4
 <2><e06>: Abbrev Number: 19 (DW_TAG_member)
    <e07>   DW_AT_name        : (indirect string, offset: 0x974d0): Lock
    <e0b>   DW_AT_decl_file   : 8
    <e0c>   DW_AT_decl_line   : 144
    <e0d>   DW_AT_decl_column : 30
    <e0e>   DW_AT_type        : <0xcdd>
    <e12>   DW_AT_data_member_location: 52
 <2><e13>: Abbrev Number: 19 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xd15cd): State
    <e18>   DW_AT_decl_file   : 8
    <e19>   DW_AT_decl_line   : 146
    <e1a>   DW_AT_decl_column : 30
    <e1b>   DW_AT_type        : <0xdda>
    <e1f>   DW_AT_data_member_location: 53
 <2><e20>: Abbrev Number: 19 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0xc6655): Parent
    <e25>   DW_AT_decl_file   : 8
    <e26>   DW_AT_decl_line   : 148
    <e27>   DW_AT_decl_column : 31
    <e28>   DW_AT_type        : <0x693>
    <e2c>   DW_AT_data_member_location: 56
 <2><e2d>: Abbrev Number: 19 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xcf5b0): XferCpltCallback
    <e32>   DW_AT_decl_file   : 8
    <e33>   DW_AT_decl_line   : 150
    <e34>   DW_AT_decl_column : 33
    <e35>   DW_AT_type        : <0xeba>
    <e39>   DW_AT_data_member_location: 60
 <2><e3a>: Abbrev Number: 19 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xa46bf): XferHalfCpltCallback
    <e3f>   DW_AT_decl_file   : 8
    <e40>   DW_AT_decl_line   : 152
    <e41>   DW_AT_decl_column : 33
    <e42>   DW_AT_type        : <0xeba>
    <e46>   DW_AT_data_member_location: 64
 <2><e47>: Abbrev Number: 19 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0xbef7d): XferM1CpltCallback
    <e4c>   DW_AT_decl_file   : 8
    <e4d>   DW_AT_decl_line   : 154
    <e4e>   DW_AT_decl_column : 33
    <e4f>   DW_AT_type        : <0xeba>
    <e53>   DW_AT_data_member_location: 68
 <2><e54>: Abbrev Number: 19 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x68731): XferM1HalfCpltCallback
    <e59>   DW_AT_decl_file   : 8
    <e5a>   DW_AT_decl_line   : 156
    <e5b>   DW_AT_decl_column : 33
    <e5c>   DW_AT_type        : <0xeba>
    <e60>   DW_AT_data_member_location: 72
 <2><e61>: Abbrev Number: 19 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x274fd): XferErrorCallback
    <e66>   DW_AT_decl_file   : 8
    <e67>   DW_AT_decl_line   : 158
    <e68>   DW_AT_decl_column : 33
    <e69>   DW_AT_type        : <0xeba>
    <e6d>   DW_AT_data_member_location: 76
 <2><e6e>: Abbrev Number: 19 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0xc2c84): XferAbortCallback
    <e73>   DW_AT_decl_file   : 8
    <e74>   DW_AT_decl_line   : 160
    <e75>   DW_AT_decl_column : 33
    <e76>   DW_AT_type        : <0xeba>
    <e7a>   DW_AT_data_member_location: 80
 <2><e7b>: Abbrev Number: 19 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xcbb00): ErrorCode
    <e80>   DW_AT_decl_file   : 8
    <e81>   DW_AT_decl_line   : 162
    <e82>   DW_AT_decl_column : 30
    <e83>   DW_AT_type        : <0xba7>
    <e87>   DW_AT_data_member_location: 84
 <2><e88>: Abbrev Number: 19 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0x61d60): StreamBaseAddress
    <e8d>   DW_AT_decl_file   : 8
    <e8e>   DW_AT_decl_line   : 164
    <e8f>   DW_AT_decl_column : 30
    <e90>   DW_AT_type        : <0xb9b>
    <e94>   DW_AT_data_member_location: 88
 <2><e95>: Abbrev Number: 19 (DW_TAG_member)
    <e96>   DW_AT_name        : (indirect string, offset: 0xb0dc4): StreamIndex
    <e9a>   DW_AT_decl_file   : 8
    <e9b>   DW_AT_decl_line   : 166
    <e9c>   DW_AT_decl_column : 30
    <e9d>   DW_AT_type        : <0xb9b>
    <ea1>   DW_AT_data_member_location: 92
 <2><ea2>: Abbrev Number: 0
 <1><ea3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ea4>   DW_AT_byte_size   : 4
    <ea5>   DW_AT_type        : <0xc0a>
 <1><ea9>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <eaa>   DW_AT_prototyped  : 1
    <eaa>   DW_AT_sibling     : <0xeb4>
 <2><eae>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <eaf>   DW_AT_type        : <0xeb4>
 <2><eb3>: Abbrev Number: 0
 <1><eb4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb5>   DW_AT_byte_size   : 4
    <eb6>   DW_AT_type        : <0xddf>
 <1><eba>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ebb>   DW_AT_byte_size   : 4
    <ebc>   DW_AT_type        : <0xea9>
 <1><ec0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xb2cb3): DMA_HandleTypeDef
    <ec5>   DW_AT_decl_file   : 8
    <ec6>   DW_AT_decl_line   : 168
    <ec7>   DW_AT_decl_column : 2
    <ec8>   DW_AT_type        : <0xddf>
 <1><ecc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ecd>   DW_AT_byte_size   : 4
    <ece>   DW_AT_type        : <0xec0>
 <1><ed2>: Abbrev Number: 18 (DW_TAG_structure_type)
    <ed3>   DW_AT_byte_size   : 28
    <ed4>   DW_AT_decl_file   : 9
    <ed5>   DW_AT_decl_line   : 46
    <ed6>   DW_AT_decl_column : 9
    <ed7>   DW_AT_sibling     : <0xf37>
 <2><edb>: Abbrev Number: 19 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0xbece3): BaudRate
    <ee0>   DW_AT_decl_file   : 9
    <ee1>   DW_AT_decl_line   : 48
    <ee2>   DW_AT_decl_column : 12
    <ee3>   DW_AT_type        : <0xb9b>
    <ee7>   DW_AT_data_member_location: 0
 <2><ee8>: Abbrev Number: 19 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x107b9): WordLength
    <eed>   DW_AT_decl_file   : 9
    <eee>   DW_AT_decl_line   : 54
    <eef>   DW_AT_decl_column : 12
    <ef0>   DW_AT_type        : <0xb9b>
    <ef4>   DW_AT_data_member_location: 4
 <2><ef5>: Abbrev Number: 19 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xbf089): StopBits
    <efa>   DW_AT_decl_file   : 9
    <efb>   DW_AT_decl_line   : 57
    <efc>   DW_AT_decl_column : 12
    <efd>   DW_AT_type        : <0xb9b>
    <f01>   DW_AT_data_member_location: 8
 <2><f02>: Abbrev Number: 19 (DW_TAG_member)
    <f03>   DW_AT_name        : (indirect string, offset: 0x42d8d): Parity
    <f07>   DW_AT_decl_file   : 9
    <f08>   DW_AT_decl_line   : 60
    <f09>   DW_AT_decl_column : 12
    <f0a>   DW_AT_type        : <0xb9b>
    <f0e>   DW_AT_data_member_location: 12
 <2><f0f>: Abbrev Number: 19 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0xd5b08): Mode
    <f14>   DW_AT_decl_file   : 9
    <f15>   DW_AT_decl_line   : 67
    <f16>   DW_AT_decl_column : 12
    <f17>   DW_AT_type        : <0xb9b>
    <f1b>   DW_AT_data_member_location: 16
 <2><f1c>: Abbrev Number: 19 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x22559): HwFlowCtl
    <f21>   DW_AT_decl_file   : 9
    <f22>   DW_AT_decl_line   : 70
    <f23>   DW_AT_decl_column : 12
    <f24>   DW_AT_type        : <0xb9b>
    <f28>   DW_AT_data_member_location: 20
 <2><f29>: Abbrev Number: 19 (DW_TAG_member)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xb06ae): OverSampling
    <f2e>   DW_AT_decl_file   : 9
    <f2f>   DW_AT_decl_line   : 73
    <f30>   DW_AT_decl_column : 12
    <f31>   DW_AT_type        : <0xb9b>
    <f35>   DW_AT_data_member_location: 24
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 4 (DW_TAG_typedef)
    <f38>   DW_AT_name        : (indirect string, offset: 0x41dbe): UART_InitTypeDef
    <f3c>   DW_AT_decl_file   : 9
    <f3d>   DW_AT_decl_line   : 75
    <f3e>   DW_AT_decl_column : 3
    <f3f>   DW_AT_type        : <0xed2>
 <1><f43>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 1
    <f46>   DW_AT_type        : <0x651>
    <f4a>   DW_AT_decl_file   : 9
    <f4b>   DW_AT_decl_line   : 117
    <f4c>   DW_AT_decl_column : 1
    <f4d>   DW_AT_sibling     : <0xf82>
 <2><f51>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f52>   DW_AT_name        : (indirect string, offset: 0x7dd66): HAL_UART_STATE_RESET
    <f56>   DW_AT_const_value : 0
 <2><f57>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f58>   DW_AT_name        : (indirect string, offset: 0x21bc0): HAL_UART_STATE_READY
    <f5c>   DW_AT_const_value : 32
 <2><f5d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xb971e): HAL_UART_STATE_BUSY
    <f62>   DW_AT_const_value : 36
 <2><f63>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f64>   DW_AT_name        : (indirect string, offset: 0xd4ca): HAL_UART_STATE_BUSY_TX
    <f68>   DW_AT_const_value : 33
 <2><f69>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f6a>   DW_AT_name        : (indirect string, offset: 0xc80e): HAL_UART_STATE_BUSY_RX
    <f6e>   DW_AT_const_value : 34
 <2><f6f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f70>   DW_AT_name        : (indirect string, offset: 0xb0a5f): HAL_UART_STATE_BUSY_TX_RX
    <f74>   DW_AT_const_value : 35
 <2><f75>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f76>   DW_AT_name        : (indirect string, offset: 0x69460): HAL_UART_STATE_TIMEOUT
    <f7a>   DW_AT_const_value : 160
 <2><f7b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x93e10): HAL_UART_STATE_ERROR
    <f80>   DW_AT_const_value : 224
 <2><f81>: Abbrev Number: 0
 <1><f82>: Abbrev Number: 4 (DW_TAG_typedef)
    <f83>   DW_AT_name        : (indirect string, offset: 0x46998): HAL_UART_StateTypeDef
    <f87>   DW_AT_decl_file   : 9
    <f88>   DW_AT_decl_line   : 135
    <f89>   DW_AT_decl_column : 3
    <f8a>   DW_AT_type        : <0xf43>
 <1><f8e>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <f8f>   DW_AT_type        : <0xf82>
 <1><f93>: Abbrev Number: 4 (DW_TAG_typedef)
    <f94>   DW_AT_name        : (indirect string, offset: 0x5a767): HAL_UART_RxTypeTypeDef
    <f98>   DW_AT_decl_file   : 9
    <f99>   DW_AT_decl_line   : 144
    <f9a>   DW_AT_decl_column : 18
    <f9b>   DW_AT_type        : <0xb9b>
 <1><f9f>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <fa0>   DW_AT_type        : <0xf93>
 <1><fa4>: Abbrev Number: 20 (DW_TAG_structure_type)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x7c1e3): __UART_HandleTypeDef
    <fa9>   DW_AT_byte_size   : 68
    <faa>   DW_AT_decl_file   : 9
    <fab>   DW_AT_decl_line   : 149
    <fac>   DW_AT_decl_column : 16
    <fad>   DW_AT_sibling     : <0x1075>
 <2><fb1>: Abbrev Number: 19 (DW_TAG_member)
    <fb2>   DW_AT_name        : (indirect string, offset: 0xc98b4): Instance
    <fb6>   DW_AT_decl_file   : 9
    <fb7>   DW_AT_decl_line   : 151
    <fb8>   DW_AT_decl_column : 34
    <fb9>   DW_AT_type        : <0x1075>
    <fbd>   DW_AT_data_member_location: 0
 <2><fbe>: Abbrev Number: 19 (DW_TAG_member)
    <fbf>   DW_AT_name        : (indirect string, offset: 0xd5481): Init
    <fc3>   DW_AT_decl_file   : 9
    <fc4>   DW_AT_decl_line   : 153
    <fc5>   DW_AT_decl_column : 33
    <fc6>   DW_AT_type        : <0xf37>
    <fca>   DW_AT_data_member_location: 4
 <2><fcb>: Abbrev Number: 19 (DW_TAG_member)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x67de5): pTxBuffPtr
    <fd0>   DW_AT_decl_file   : 9
    <fd1>   DW_AT_decl_line   : 155
    <fd2>   DW_AT_decl_column : 34
    <fd3>   DW_AT_type        : <0x107b>
    <fd7>   DW_AT_data_member_location: 32
 <2><fd8>: Abbrev Number: 19 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x5ca2d): TxXferSize
    <fdd>   DW_AT_decl_file   : 9
    <fde>   DW_AT_decl_line   : 157
    <fdf>   DW_AT_decl_column : 33
    <fe0>   DW_AT_type        : <0xb8a>
    <fe4>   DW_AT_data_member_location: 36
 <2><fe5>: Abbrev Number: 19 (DW_TAG_member)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x6928e): TxXferCount
    <fea>   DW_AT_decl_file   : 9
    <feb>   DW_AT_decl_line   : 159
    <fec>   DW_AT_decl_column : 33
    <fed>   DW_AT_type        : <0xb96>
    <ff1>   DW_AT_data_member_location: 38
 <2><ff2>: Abbrev Number: 19 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xc1e7f): pRxBuffPtr
    <ff7>   DW_AT_decl_file   : 9
    <ff8>   DW_AT_decl_line   : 161
    <ff9>   DW_AT_decl_column : 34
    <ffa>   DW_AT_type        : <0x1081>
    <ffe>   DW_AT_data_member_location: 40
 <2><fff>: Abbrev Number: 19 (DW_TAG_member)
    <1000>   DW_AT_name        : (indirect string, offset: 0x6bb21): RxXferSize
    <1004>   DW_AT_decl_file   : 9
    <1005>   DW_AT_decl_line   : 163
    <1006>   DW_AT_decl_column : 33
    <1007>   DW_AT_type        : <0xb8a>
    <100b>   DW_AT_data_member_location: 44
 <2><100c>: Abbrev Number: 19 (DW_TAG_member)
    <100d>   DW_AT_name        : (indirect string, offset: 0x80a86): RxXferCount
    <1011>   DW_AT_decl_file   : 9
    <1012>   DW_AT_decl_line   : 165
    <1013>   DW_AT_decl_column : 33
    <1014>   DW_AT_type        : <0xb96>
    <1018>   DW_AT_data_member_location: 46
 <2><1019>: Abbrev Number: 19 (DW_TAG_member)
    <101a>   DW_AT_name        : (indirect string, offset: 0xaf904): ReceptionType
    <101e>   DW_AT_decl_file   : 9
    <101f>   DW_AT_decl_line   : 167
    <1020>   DW_AT_decl_column : 31
    <1021>   DW_AT_type        : <0xf9f>
    <1025>   DW_AT_data_member_location: 48
 <2><1026>: Abbrev Number: 19 (DW_TAG_member)
    <1027>   DW_AT_name        : (indirect string, offset: 0xcafa2): hdmatx
    <102b>   DW_AT_decl_file   : 9
    <102c>   DW_AT_decl_line   : 169
    <102d>   DW_AT_decl_column : 34
    <102e>   DW_AT_type        : <0xecc>
    <1032>   DW_AT_data_member_location: 52
 <2><1033>: Abbrev Number: 19 (DW_TAG_member)
    <1034>   DW_AT_name        : (indirect string, offset: 0xca36a): hdmarx
    <1038>   DW_AT_decl_file   : 9
    <1039>   DW_AT_decl_line   : 171
    <103a>   DW_AT_decl_column : 34
    <103b>   DW_AT_type        : <0xecc>
    <103f>   DW_AT_data_member_location: 56
 <2><1040>: Abbrev Number: 19 (DW_TAG_member)
    <1041>   DW_AT_name        : (indirect string, offset: 0x974d0): Lock
    <1045>   DW_AT_decl_file   : 9
    <1046>   DW_AT_decl_line   : 173
    <1047>   DW_AT_decl_column : 33
    <1048>   DW_AT_type        : <0xcdd>
    <104c>   DW_AT_data_member_location: 60
 <2><104d>: Abbrev Number: 19 (DW_TAG_member)
    <104e>   DW_AT_name        : (indirect string, offset: 0x59cf6): gState
    <1052>   DW_AT_decl_file   : 9
    <1053>   DW_AT_decl_line   : 175
    <1054>   DW_AT_decl_column : 33
    <1055>   DW_AT_type        : <0xf8e>
    <1059>   DW_AT_data_member_location: 61
 <2><105a>: Abbrev Number: 19 (DW_TAG_member)
    <105b>   DW_AT_name        : (indirect string, offset: 0xbc3f4): RxState
    <105f>   DW_AT_decl_file   : 9
    <1060>   DW_AT_decl_line   : 179
    <1061>   DW_AT_decl_column : 33
    <1062>   DW_AT_type        : <0xf8e>
    <1066>   DW_AT_data_member_location: 62
 <2><1067>: Abbrev Number: 19 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0xcbb00): ErrorCode
    <106c>   DW_AT_decl_file   : 9
    <106d>   DW_AT_decl_line   : 182
    <106e>   DW_AT_decl_column : 33
    <106f>   DW_AT_type        : <0xba7>
    <1073>   DW_AT_data_member_location: 64
 <2><1074>: Abbrev Number: 0
 <1><1075>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1076>   DW_AT_byte_size   : 4
    <1077>   DW_AT_type        : <0xc82>
 <1><107b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <107c>   DW_AT_byte_size   : 4
    <107d>   DW_AT_type        : <0xb85>
 <1><1081>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1082>   DW_AT_byte_size   : 4
    <1083>   DW_AT_type        : <0xb79>
 <1><1087>: Abbrev Number: 4 (DW_TAG_typedef)
    <1088>   DW_AT_name        : (indirect string, offset: 0x7c1e5): UART_HandleTypeDef
    <108c>   DW_AT_decl_file   : 9
    <108d>   DW_AT_decl_line   : 200
    <108e>   DW_AT_decl_column : 3
    <108f>   DW_AT_type        : <0xfa4>
 <1><1093>: Abbrev Number: 21 (DW_TAG_array_type)
    <1094>   DW_AT_type        : <0xb79>
    <1098>   DW_AT_sibling     : <0x10a3>
 <2><109c>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <109d>   DW_AT_type        : <0x622>
    <10a1>   DW_AT_upper_bound : 13
 <2><10a2>: Abbrev Number: 0
 <1><10a3>: Abbrev Number: 23 (DW_TAG_variable)
    <10a4>   DW_AT_name        : (indirect string, offset: 0xb21f0): HEADER2
    <10a8>   DW_AT_decl_file   : 10
    <10a9>   DW_AT_decl_line   : 39
    <10aa>   DW_AT_decl_column : 16
    <10ab>   DW_AT_type        : <0x1093>
    <10af>   DW_AT_external    : 1
    <10af>   DW_AT_declaration : 1
 <1><10af>: Abbrev Number: 21 (DW_TAG_array_type)
    <10b0>   DW_AT_type        : <0xb79>
    <10b4>   DW_AT_sibling     : <0x10bf>
 <2><10b8>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10b9>   DW_AT_type        : <0x622>
    <10bd>   DW_AT_upper_bound : 15
 <2><10be>: Abbrev Number: 0
 <1><10bf>: Abbrev Number: 23 (DW_TAG_variable)
    <10c0>   DW_AT_name        : (indirect string, offset: 0xb21f8): HEADER3
    <10c4>   DW_AT_decl_file   : 10
    <10c5>   DW_AT_decl_line   : 40
    <10c6>   DW_AT_decl_column : 16
    <10c7>   DW_AT_type        : <0x10af>
    <10cb>   DW_AT_external    : 1
    <10cb>   DW_AT_declaration : 1
 <1><10cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <10cc>   DW_AT_byte_size   : 1
    <10cd>   DW_AT_encoding    : 2	(boolean)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x59562): _Bool
 <1><10d2>: Abbrev Number: 23 (DW_TAG_variable)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x4577c): TickSerial
    <10d7>   DW_AT_decl_file   : 10
    <10d8>   DW_AT_decl_line   : 42
